SHIKAKU_L="■";
KUHAKU_L=" ";
MARU_L="●";
SANKAKU1_L="▼";
SANKAKU2_L="◀";
SANKAKU3_L="▶";
YAJIRUSI_R="←";
YAJIRUSI_L="→";
STAR="★";
var JOB_LIST = new Array();
HATENA ="??????";

//言語選択
function setLanguage(){
    //setJPN();
    if(LANGUAGE == 0){
         setJPN();
     }else if(LANGUAGE == 1){
         setENG();
     }
}

function setJPN(){
    GAME_NAME = "ファンタシーマスター";
    
    FANTASIA_REKI ="王国歴:";
    FANTASIA_YEAR ="年";
    FANTASIA_DATE ="日目";
    DATE_COMMNET=["新年おめでとう！<BR>キミは一つ年を重ねた。",
                "今日は幻想祭の日だ。<BR>たいまつの廻りで幻想的な踊りが行われている。",
                "今日は竜王祭の日だ。<BR>そこかしこでドラゴンステーキが振る舞われている。",
                "一年で最後の日だ。<BR>新年を迎える準備で町はにぎわっている。",
                "さあ今日から長い冒険の始まりだ！！<BR>まずは酒場で情報を仕入れるといいぞ。"];
    
    TWEET_L = "冒険の報告をつぶやく";
    
    ONLINE_L = "オンラインテスト";

    NEXT_L="次へ▶";
    RETURN_L="◀戻る";
    BACK_L="◀前へ";
    RETURNTOWN_L="◀町へ戻る";
    NEXT_STAGE_L="次へ進む▶";
    PROLOG_L="ようこそ暗黒の島、ファンタジアへ。"+"<br>"
            +"この島でやる事はただひとつ！！"+"<br>"
          　+"伝説の武器「ファンタシーマスター」を手に入れて、自分の強さを証明するのだ！"+"<br>"
          　+"私からはこの魔法のアミュレットをキミにプレゼントしよう。"+"<br>"
            +"さあ、町で準備を整えて出発するがよい！！";
    BONUS_T="キャラ作成";
    NAME_L="なまえ";
    JOB_L="職業"; 
    WEAPON_L="ぶき"; 
    AGE_L="年齢";     
    ITEM_L="アイテム";  
    EQUIP_L="武器そうび";  
    EQUIP_A_L="アクセサリそうび";  
    
    CHANGE_L="[E]⇔[SUB]";  
    CHANGE2_L="そうび解除";
    LEVEL_L="レベル";
    STATUS_L="ステータス";
    JOB_POINT_L="職業ポイント";
    RECORD_L="ぼうけんの記録";    
    OUT_SET_L="文字の表示設定";
    OUT_SET_A=["冒険者のダメージ","敵へのダメージ","冒険者HPの回復","冒険者MPの回復","敵のHP回復","冒険者の回避","敵の回避","経験値","宝箱","お金","クリスタル","敵出現メッセージ","ボス出現メッセージ","討伐メッセージ","レベルアップメッセージ"];
    
    TAKE_L="継承回数";    
    ST1_L="ちから";
    ST2_L="すばやさ";
    ST3_L="きようさ";    
    ST4_L="たいりょく";
    ST5_L="まりょく";
    ST6_L="しんこうしん";
    ST7_L="うん";
    ST8_L="ボーナス";
    EXP_L="けいけんち";
    GLD_L="ゴールド　";
    CRY_L="クリスタル";    
    DT1="物理攻撃力";
    DT2="物理防御力";
    DT15="命中率";
    DT3="回避率";
    DT4="攻撃速度";
    DT5="会心率";
    DT6="会心倍率";
    DT7="移動速度";
    DT8="魔法攻撃力";
    DT9="魔法防御力";
    DT10="絶対防御力";
    DT11="状態異常耐性";
    DT12="HP";
    DT13="MP";
    DT14="自然回復力";
    DT16="吹き飛ばし";
    DT17="絶対攻撃力";    
    DT18="利用可能重量";
    DT19="自然回復速度";
    DT20="クラス";
    DT21="級";
    
    SPECIAL_L = "タイプ";
    WEAPON_TYPE_L =["近接","農具","刀","盾","遠距離","中距離","回復","魔法攻撃","秘宝","治療","移動","奥義","忍具","楽器","防具","聖剣","機械","七つ道具","召還","ダウジング","神器"];
    //熟練度+
    WEAPON_TYPE_P_L =["物理攻撃","物理攻撃","会心倍率","回避率","命中率","物理攻撃","回復力","魔法攻撃","絶対攻撃","状態異常耐性","物理防御","物理攻撃","会心率","物理攻撃","物理防御","回復","命中率","回避率","命中率","命中率","会心倍率"];
    JOB_SPECIAL_L = "武器タイプ＆効果";
    JOB_TYPE_L =["物理攻撃","物理攻撃＆物理防御","会心率","回避率","命中率","物理攻撃","回復力","魔法攻撃","レア敵遭遇率","状態異常耐性","移動速度","絶対攻撃","会心倍率","吹き飛ばし","物理防御","絶対防御","物理攻撃","レア武器率","魔法攻撃","クリスタル出現","絶対攻撃"];
    POINT = "ポイント";
    WEAPON_COUNT = "熟練度";
    
    //JOB_LIST = new Array("村人","戦士");
    WHAT_COMMENT = "さて、どうする？";
    WHAT_COMMENT2 = "ここより魔界。<BR>人間が行く場所ではない。気をつけろ！！";
    WHAT_COMMENT3 = "夜空に星が瞬いている";

    TOWN_T="城下町";
    GATE_T="町外れ";
    GATE2_T="町外れの崖1(寄り道)";
    GATE3_T="町外れの崖2(寄り道)";        
    GATE4_T="最果ての地";        

    ENDING = "キミはこの世界の全てを手に入れた。ファンタシーマスターの称号を授けよう!<BR>"+
    "Thank you for playing!!<BR>"+
    "By Yamaoh Games<BR>"+
    "";
    
    ENDING2 = ["到達の星","武器の星","職業の星","討伐の星","ダメージの星","レベルの星","塔の星","継承の星","総合の星","ゴールドの星","クリスタルの星","敵の星"];
    
    CASTLE_T="ファンタジア城 謁見の間";    
    PUB_T="酒場　オサコレ亭";    
    WEAPON_T="武器屋　タックボル商店";    
    TEMPLE_T="中央図書館";        
    INN_T="宿屋 月のしずく";
    SMITH_T="老ドワーフの鍛冶屋";
    TOWER_T="バベルの塔";
    CLOUD_T="雲の世界";    
    WAL_GATE_T="ヴァルハラへの入り口";
    DOJO_T="道場";
    DOJO2_T="道場(継承)";    
    DOJO3_T="道場(継承終了)";   
    DOJO4_T="道場主のステータス";
    PARTY_T = "仲間に加える";

    STAGE0="ファンタジア草原";
    STAGE1="北方の砂漠";
    STAGE2="妖精の谷";
    STAGE3="幻の湖";
    STAGE4="南方の雪原";
    STAGE5="天上の山脈";
    STAGE6="未踏の秘境";
    STAGE7="静寂の海";
    STAGE8="浮遊大陸";
    STAGE9="古の決戦場(夕)";
    STAGE10="古の決戦場(夜)";
    STAGE11="古の決戦場(朝)";
    STAGE12="魔界の門";    
    STAGE13="魔界";
    STAGE14="大魔界";
    STAGE15="魔界宮";    
    STAGE94="竜の祭壇";                
    STAGE95="封印のどうくつ";            
    STAGE96="雲のどうくつ";        
    STAGE97="青水晶のどうくつ";    
    STAGE98="ゴム質のどうくつ";    
    STAGE99="エナメル質のどうくつ";
    STAGE100="妖魔の洞窟";
    STAGE104="魔法学院";
    STAGE108="巨人族の集落";
    STAGE112="獣人の楽園";  
    STAGE116="修羅の国";        
    STAGE120="伯爵の館";    
    STAGE124="宝物庫";
    STAGE128="隠れ里";
    STAGE132="マジョリカ";    
    STAGE136="弓取り合戦";
    STAGE140="東方の島国";    
    STAGE144="小さな王国"; 
    STAGE148="魔導巨石兵製造工場";        
    STAGE152="初心者の館";            
    STAGE993="オーディン宮殿";       
    STAGE994="オーディン宮殿の玄関前";             
    STAGE995="オーディン宮殿の中庭";         
    STAGE996="オーディン宮殿の門";        
    STAGE997="ヴァルハラの深淵";
    STAGE998="ヴァルハラの中原";
    STAGE999="ヴァルハラの外苑";    
    STAGE1010="ミノタウロスの迷宮";

    STEP="ステップ";
    
    STAGE_CLEAR_L="きみはここでキャンプをする事とした。"+"<br>"
        +"町に戻りますか？"+"<br>"
        +"それとも先に進みますか？"+"<br>";

    STAGE_CLEAR_L2="きみは最深部までたどり着いた!"+"<br>"
        +"新しい冒険先を発見した！！"+"<br>"
        +"町に戻ります。"+"<br>";
        
    STAGE_CLEAR_L3="きみは最深部までたどり着いた!"+"<br>"
        //+"このゲームバランスでここまで来るとはすごい！アプリのページにコメント頂けると大変喜びます・・・。"+"<br>";        
        +"続きは開発中です。。。どうぞお待ちくださいませ！！"+"<br>";        

    STAGE_CLEAR_L4="きみは最深部までたどり着いた!"+"<br>"
        //+"新しい冒険先を発見した！！"+"<br>"
        +"町に戻ります。"+"<br>";
        
    STAGE_CLEAR_L5="同じ冒険先に旅立つ";
        
        
    GAMEOVER_L="きみは死んでしまった！"+"<br>"
        +"ざんねんだが、後の事は次の勇者にまかせて永遠の眠りにつくがいい"+"<br>"
        +"";        
    GAMEOVER_L2="■転生の間"+"<br>"
        +"汝、転生を望むか？"+"<br>"
        +"";        
        
    CASTLE_L="ぼうけんしゃよ、よく来た。"+"<br>"
        +"どの職業につきたいのじゃ？"+"<br>"    
        +"";
    CASTLE_L2="よし、今からそなたは"
        +"";
    CASTLE_L3="じゃ！"+"<br>"
    　　+"こころしてがんばるのじゃぞ！"+"<br>"
        +"";        
    CASTLE_L4="この職業レベルをあげたいと申すのか？"+"<br>"
    　　+"それにはこれだけの準備金が必要じゃ！"+"<br>"
        +""; 
    CASTLE_L5="よし、ではこの職業のレベルをあげよう！"+"<br>"
    　　+"ファンタジアの神々の祝福あれ！！"+"<br>"
        +"";
    CASTLE_L6="ふむ、また次の機会とするがよい。"+"<br>"
        +"";        
    CASTLE_L7="準備金が足りぬようだな。出直してまいれ。"+"<br>"
        +"";               
        
    PUB_L="いらっしゃい！！"+"<br>"    
        +"今日はだれかとお話しする？";
    SMITH_L="なんのようじゃ・・・・。"+"<br>"
        +"クリスタルがあればアミュレットにルーンを刻んでやるぞ。"+"<br>"
        +"";
    WEAPON_STORE_L="いらっしゃい！今日はどうする？"+"<br>"
        +"";
    WEAPON_STORE_L2="だね！！<BR>まいどありー！"+"<br>"
        +"";
    WEAPON_STORE_L3="おいおい、装備がいっぱいでそれ以上持てないようだぞ？"+"<br>"
        +"";
    WEAPON_STORE_L4="を買うには金が足りないようだね。"+"<br>"
        +"";
    WEAPON_STORE_L5="を買うのかい？"+"<br>"
        +"";     
    WEAPON_STORE_L6="おいおい、売る物なんて何も持って無いじゃないか。"+"<br>"
        +"";                
    WEAPON_STORE_L7="を売ってくれるのかい？"+"<br>"
        +"";                
    WEAPON_STORE_L8="何を買うんだい？"+"<br>"
        +"";             
    WEAPON_STORE_L9="何を売るんだい？"+"<br>"
        +"";  
    WEAPON_STORE_L10="装備している武器を買うわけにはいかんなあ・・・。"+"<br>"
        +"";          
    WEAPON_STORE_L11="だね！！<BR>それがさいごのひとつだよ！"+"<br>"
        +"";  
    WEAPON_STORE_L12="だね！！<BR>まいど！!続けて何か売るかい？"+"<br>" ;  
    
    WEAPON_STORE_L13="そうび品以外全て売る" ;  

    WEAPON_STORE_L14="だね！！<BR>むう、あなたはジョブマスター！！"+"<br>"
        +"よしこの商品は特別に在庫を補充しておきますよ。";  

    WEAPON_STORE_E01="";
    WEAPON_STORE_E02="";    
        
    TEMPLE_L="ようこそ、中央図書館へ"+"<br>"
        +"どの本を読むかね？"+"<br>"    
       // +"オーノー!!今は本をきらしていた。また来てくれたまえよ。"+"<br>"
        +"";        
    INN_L="お、「村人」さんだね！"+"<br>"
        +"お代はいらないから、泊まっていくといいよ！"+"<br>"
        +"きみの体力が全快した！！"+"<br>"
        +"";
    INN_L2="お疲れさまでしたー！"+"<br>"
        +"泊まって行きますか？"+"<br>"
        +"";    
    INN_L3="お金が足りないねえ・・・野宿でもしとけ？"+"<br>"
        +"";         
    INN_L4="おやすみ・・・おはよう！"+"<br>"
        +"きみの魔力が全快した！！"+"<br>"    
        +"";         
    INN_L5="おやすみ・・・おはよう！"+"<br>"
        +"きみの体力が全快した！！"+"<br>"    
        +"";         
    INN_L6="おやすみ・・・おはよう！"+"<br>"
        +"きみの体力・魔力が全快した！！"+"<br>"    
        +"";         
    INN_L7="あ、「村長」さん！！"+"<br>"
        +"いつもお疲れさまです。お代はいいのでゆっくりとしていってくださいね！"+"<br>"
        +"特別マッサージもしちゃいます・・・・・・・"+"<br>"        
        +"・・・・・キミの体力・魔力が200%全快した！！"+"<br>"
        +"";         
    INN_L8="これはこれは宰相様ではないですか！！"+"<br>"
        +"とっておきのロイヤルスイートにご案内しちゃいます！"+"<br>"
        +"ぜひ日頃の疲れをとってゆっくりしていってくださいね！"+"<br>"        
        +"・・・・・キミの体力・魔力が1000%全快した！！"+"<br>"
        +"";              
    GATE_L="さて、どこへ行こうか？"+"<br>"+"";
    GATE_L2="「初心者入るべからず」という立て札がある。"+"<br>"+"";
    GATE_L3="「挑戦者求む」という立て札がある。"+"<br>"+"";            
        
    //TITLE1 = "β版(このバージョンは開発中です)";
    TITLE1 = "";
    SETTING ="■記録帳";
    TOTITLE = "■タイトルに戻る";
    TOTITLE1 = "本当にタイトルに戻りますか？";    
    COMFIRM1 = "本当にいいんですね？";
    BUY ="■買う";
    SELL ="■売る";
    STAY ="■泊まる";
    STAY1 ="馬小屋";    
    STAY11 ="馬小屋(連泊)";   
    STAY2 ="布団部屋";        
    STAY3 ="奥座敷";     
    STAY4 ="スイート";     
    STAY5 ="ロイヤルスイート";     
    STAY6 ="ロングステイ";         
    DONTBUY ="■買わない";
    DONTSELL ="■売らない";
    GOLD ="ゴールド:";
    CRY ="クリスタル:";    
    OVER_YES ="■転生する(引き継ぎあり)";
    OVER_NO ="■転生しない(引き継ぎなし)";
    OVER_NO_COMMENT ="本当にいいんだな？";
    PLAYER_NAME ="番目のゆうしゃ";
    PLAYER_NAME2 ="番目の";
    STAGE_START = "キミは冒険を開始した。";
    ENEMY_START = "があらわれた！";
    ENEMY_END = "を倒した";
    ENEMY_RUN = "は逃げ出した！";
    LEVELUP1 = "キミはレベルがあがった！";
    EQUIP1 = "■[E]装備中の武器を捨てる";
    EQUIP11 = "本当に捨てていいのかい？";    
    EQUIP2 = "素手を捨てるとは恐ろしい・・・!";
    EQUIP21 = "何も装備していないぞ!";
    
    BAIRITU = "倍率";
    
    BOOKS= ["■職業の本","■ステータスの本","■武器図鑑","■モンスター大全","■ルーンの書","■ぼうけんの書(あそびかた)"];
    BOOK1="どの項目を読む？";
    BOOK01=" <BR>[LEVEL UP]";
    BOOK11=["ちから","すばやさ","きようさ","たいりょく","まりょく","しんこうしん","うん"];
    BOOK12=["「ちから」が上がると、物理攻撃力、絶対攻撃力が上がり武器で敵にダメージを与えやすくなります。また重い武器を扱えるようになります。",
            "「すばやさ」が上がると、回避率、移動速度、攻撃速度が上がります。",
            "「きようさ」が上がると、命中率、会心率、会心倍率が上がります。",
            "「たいりょく」が上がると、物理防御力、最大ＨＰが上がります。また重い武器を扱えるようになります。",
            "「まりょく」が上がると、魔法攻撃力、絶対攻撃力、魔法防御力、最大ＭＰが上がります。また少しずつ呪文の詠唱が速くなります。",
            "「しんこうしん」が上がると、絶対防御力、状態異常耐性、自然回復力、最大ＭＰが上がります。",
            "「うん」が上がると、命中率、会心率が上がり、また敵を倒した時にアイテムが出やすくなります。"
            ];
    BOOK31 ="たおした数";
    BOOK51=["町での準備","職業","武器を買う","冒険に出る","セーブのタイミング","王国歴と年齢","攻撃範囲","職業ポイント","武器熟練度","アクセサリ","仲間","データの移行"];
    BOOK501=["まずは町で冒険の準備をしましょう。",
            "城では職業の選択が出来ます。<BR>何回でも転職出来るのでその時にあった職業を選びましょう。<BR>あるレベルに達するとさらに職業が増えます。",
            "酒場ではさまざまなオッサン・・・もとい、ナイスミドルが集っているので、色々な情報を聞き出しましょう。<BR>皆さん、親切に教えてくれますよ。",
            "宿屋では宿泊する事によってHP,MPの回復が出来ます。職業が村人だと・・・。",
            "中央図書館では様々な知識を得る事が出来ます。<BR>ここに追加したい内容があったら、YamaohGamesにリクエストしてください。",
            "武器屋では武器の売買が出来ます。<BR>買い値の倍額で売るというとんでもない主人ですが、実はこの主人が武器図鑑を書いています。<BR>レア度が高いものは他国に輸出するようで、在庫を一つしか残しません。",
            "鍛冶屋では老ドワーフが魔法のアミュレットにルーンを刻んでくれます。<BR>アミュレットを強化し、様々なルーンを刻む事で飛躍的に能力が向上します。",
            "バベルの塔は王様が気まぐれで建てた建造物です。まだ詳細は不明です。",
            "町外れからは、冒険に出ることが出来ます。<BR>クリアすると徐々に冒険出来る先が増えて行きます。",
            "町外れ（寄り道）は、メインルートとは関係のないステージにチャレンジ出来ます。<BR>といっても相手が強いので最初は近づかない方がいいでしょうね。"
            ];
    BOOK511=["お城で王様が任命する事により、様々な職業につく事が出来ます。",
            "職業により、レベルアップ時にアップするステータスと発動するスキルが変わります。<BR>詳しくは「職業の本」をみてください。",
            "なんでもレベル４０と３００に達すると新たな職業が解放されるとか。<BR>更に３００に達するとこれまでの職業がレベルアップ可能になるらしいですよ。",
            "またその職業で敵を倒すほど職業ポイントがたまります。職業ポイントが10000を超えると免許皆伝という事で職業レベルを継承出来るようになります！更に職業と武器の相性により特殊効果が発揮されるのでがんばってみてください。"
            ];     
    BOOK521=["武器は買うだけでは効果を発揮しません。<BR>必ず装備しましょう！",
            "武器ですが、大きく分けると物理攻撃系と魔法攻撃系にわかれます。<BR>魔法の場合は、MPが足りないと発動しないので注意してください。",
            "最初は命中率が重要な要素です。<BR>武器図鑑をみながら慎重に選ぶといいですよ。<BR>最初は「たんとう」がオススメです。武器は使い続けると熟練度があがるので、好きな武器を見つけてみてください！"
            ]; 
    BOOK531=["さていよいよ冒険です。町外れから「ファンタジア草原」に行ってみましょう。",
            "冒険に出たら画面の右半分をタッチすると右に移動、左半分をタッチすると左に移動します。",
            "しばらく右に進むと敵が出てきます（たぶんスライム）。攻撃範囲に入るだけで自動的に攻撃をします。<BR>敵の方を向いて攻撃しましょう。",
            "０ステップまで戻って更に左に移動すると町に戻れます。",
            "右にずっと進み、そのステージのステップ数をこえるとステージクリアとなりキャンプに入ります。<BR>そこでは町に戻る選択も出来ますし、さらに奥に進む事も出来ます。",
            "基本的に４ステージをクリアすると、その冒険をクリアした事になります。<BR>ただし４ステージ目の最後にはＢＯＳＳが待ち構えていますので撃破するか逃げるか、頑張ってのりこえてください。",
            "クリア後は町に戻りますが、町外れに新たなステージが追加されています。<BR>より強い敵が出てきますので、町で準備をして冒険に出てください。"
            ];   
    BOOK541=["主なセーブのタイミングは以下の通りです。<BR>・ステータス画面を開いたとき<BR>・装備画面から戻るとき<BR>"
            +"・職業の変更や買い物、ルーンの強化のとき<BR>・ゲームオーバーの転生のとき<BR>・冒険から町に戻ったとき",
            "またセーブスロットは二つあり別々のデータとなっています。"];
    BOOK551=["王国暦は１年３００日です。<BR>１００日目、２００日目、３００日目にはお祭りが開催されます。",
            "誕生日ははその年の１日目になり、誕生日を迎えると年齢があがります。<BR>４０才を超えると体に異変が出るようです。<BR>年齢があがる事による自動ロストはありません。"
            ];    
    BOOK561=["武器により攻撃範囲が異なります。<BR>攻撃範囲が広いと先制攻撃が出来るなどの利点があります。<BR>ただし敵との距離により命中率に補正がかかります。",
            "距離:0 = 命中率:10倍<BR>距離:1〜10 = 命中率:3倍<BR>距離:11〜50 = 命中率:1倍<BR>距離:51〜 = 距離が長くなるほど命中率低下"            
            ]; 
    BOOK571=["職業ポイントは、敵を倒すごとに加算されます。<BR>☆1 0〜99<br>☆2 100〜299<br>☆3 300〜999<br>☆4 1000〜1999<br>☆5 2000〜4999<br>",
            "☆6 5000〜9999<br>☆7 10000〜19999 レベルアップ職業を継承可能<br>☆8 20000〜39999<br>☆9 40000〜74999<br>☆10 75000〜99999<br>☆MASTER 100000〜", 
            "職業毎に特定の武器タイプを装備するとボーナスが発生します。職業ポイントが増えると、そのボーナスの効果が増えます。",
            "職業MASTERの常時効果<BR>冒険者・・・経験値UP<BR>村人・・・宿に連泊追加<BR>戦士・・・攻撃力UP<BR>魔法使い・・・魔法攻撃力UP",
            "聖職者・・・回復力UP<BR>狩人・・・命中率UP<BR>盗賊・・・宝箱出現率のUP<BR>さむらい・・・会心倍率UP<BR>ロード・・・回復速度UP",
            "ビショップ・・・状態異常耐性UP<BR>忍者・・・会心率UP<BR>旅芸人・・・回避UP・敵出現率UP<BR>アーマー・・・守備力UP<BR>鉱脈研究家・・・クリスタル発見率UP＆クリスタル継承",
            "魔人・・・魔法防御力UP<BR>円卓の騎士・・・絶対防御力UP<BR>気闘士・・・絶対攻撃力UP<BR>機装騎士・・・最大HP UP",
            "ゆうしゃ・・・ボスへのダメージUP<BR>くぐつ使い・・・ゴールド継承<BR>スライマー・・・移動速度限界の上昇",
            
            //"村人＋農具＝攻撃+防御アップ<BR>戦士＋近接武器＝攻撃アップ<BR>魔法使い＋攻撃魔法＝魔法攻撃アップ<BR>侍＋刀＝会心率アップ<BR>ロード＋神器＝絶対攻撃アップ<BR>忍者＋忍具＝会心倍率アップ",
            //"旅芸人＋楽器＝吹き飛ばしアップ<BR>アーマー＋防具＝防御力アップ<BR>魔人＋召還＝魔法攻撃アップ<BR>円卓の騎士＋聖剣＝絶対防御アップ<BR>気闘士＋奥義＝絶対攻撃アップ<BR>機装騎士＋中距離＝攻撃アップ",
            //"くぐつし＋機械＝物理攻撃アップ<BR>狩人＋遠距離＝命中率アップ<BR>ゆうしゃ＋盾＝回避率アップ<BR>聖職者＋回復魔法＝回復力アップ<BR>ビショップ＋治療＝状態異常耐性アップ<BR>冒険者＋秘宝＝レア敵率アップ",
            //"狩人＋遠距離＝命中率アップ<BR>盗賊＋七つ道具＝レア発見率アップ<BR>鉱脈研究家＋ダウジング＝クリスタル<BR>スライマー＋移動＝スピードアップ",            
            ];             
    BOOK581=["同じ武器を使い続けるほど、その武器の熟練度があがります。熟練度があがると絶対攻撃力のボーナスが発生し、さらに武器タイプ別に物理攻撃力や魔法攻撃力などがアップしていきます。<BR>好きな武器を使い続けるのもまた一興でしょう！",
            WEAPON_TYPE_L[0] +" → "+ WEAPON_TYPE_P_L[0] + "<BR>" + WEAPON_TYPE_L[1] +" → "+ WEAPON_TYPE_P_L[1] + "<BR>" + WEAPON_TYPE_L[2] +" → "+ WEAPON_TYPE_P_L[2] + "<BR>" + WEAPON_TYPE_L[3] +" → "+ WEAPON_TYPE_P_L[3] + "<BR>" + WEAPON_TYPE_L[4] +" → "+ WEAPON_TYPE_P_L[4] + "<BR>" + WEAPON_TYPE_L[5] +" → "+ WEAPON_TYPE_P_L[5],
            WEAPON_TYPE_L[6] +" → "+ WEAPON_TYPE_P_L[6] + "<BR>" + WEAPON_TYPE_L[7] +" → "+ WEAPON_TYPE_P_L[7] + "<BR>" + WEAPON_TYPE_L[8] +" → "+ WEAPON_TYPE_P_L[8] + "<BR>" + WEAPON_TYPE_L[9] +" → "+ WEAPON_TYPE_P_L[9] + "<BR>" + WEAPON_TYPE_L[10] +" → "+ WEAPON_TYPE_P_L[10] + "<BR>" + WEAPON_TYPE_L[11] +" → "+ WEAPON_TYPE_P_L[11] ,
            WEAPON_TYPE_L[12] +" → "+ WEAPON_TYPE_P_L[12] + "<BR>" + WEAPON_TYPE_L[13] +" → "+ WEAPON_TYPE_P_L[13] + "<BR>" + WEAPON_TYPE_L[14] +" → "+ WEAPON_TYPE_P_L[14] + "<BR>" + WEAPON_TYPE_L[15] +" → "+ WEAPON_TYPE_P_L[15] +"<BR>" + WEAPON_TYPE_L[16] +" → "+ WEAPON_TYPE_P_L[16] + "<BR>" + WEAPON_TYPE_L[17] +" → "+ WEAPON_TYPE_P_L[17] ,
            WEAPON_TYPE_L[18] +" → "+ WEAPON_TYPE_P_L[18] + "<BR>" + WEAPON_TYPE_L[19] +" → "+ WEAPON_TYPE_P_L[19] + "<BR>" + WEAPON_TYPE_L[20] +" → "+ WEAPON_TYPE_P_L[20],    
            ];             
    BOOK591=["雲の世界にデータを送る事により、他の端末にセーブデータを移す事が出来ます。<BR>※クラウドサーバーのサービスは予告無しに停止・終了する事がありますのでご了承の上ご利用下さい。",
            "１．「データを雲の世界に送る」からなまえとパスワードを設定してサーバーにデータを送る。<BR>その後、ゆうしゃの名前の横に表示されるＩＤを確認します。",            
            "２．別のセーブデータから「雲のデータで生まれ変わる」に入り、１．で設定したＩＤ、なまえ、パスワードを設定して「■データを確認」→「データ確認画面へ」",                        
            "３．データを確認し「生まれ変わる」を押すと、確認したデータでプレイヤーデータを上書きします。<BR>上書きされたデータは復旧出来ませんので、ご確認の上ご利用下さい！",                                
            ]; 
    BOOK5A1=["敵が落とすアクセサリを装備すると様々な効果が発揮されます。<BR>武器の装備画面の右上からアクセサリ装備画面に移ります。<BR>もし同じアクセサリを取得した場合、効果が高ければ自動的に入れ替わります。"];             

    BOOK5B1=["仲間と一緒に冒険に出る事が出来ます。<BR>仲間がいると戦闘時を有利に進める事が出来るので、なるべく強い仲間を探しましょう！",
             "仲間にする方法<BR>・雲の世界のランキングから、対戦相手をタッチ→詳細を確認→決闘を申し込む→勝利すると相手を仲間に出来ます。<BR>・バベルの塔で勝利→終了時にまれに仲間に出来ます。",
             "仲間のステータス<BR>ステータス→仲間の名前をタッチ→仲間ステータス<BR>ここで仲間のステータスと、戦闘時の補正値を確認出来ます。",
             "仲間との別れ<BR>・プレイヤーが戦闘でやられて転生画面に行く<BR>・ステータス画面で別れるを選択する<BR>・別の対戦者を仲間とすることにより、仲間と別れる事になります。"]; 
            
    DEADSTAGE = "ん？近くでなつかしいにおいがする。";
    DEADSTAGE1= "前に倒れた冒険者のそうびを拾った！";
    
    AMULET = "アミュレット";
    SMITH_1 = "アミュレットを鍛える";
    SMITH_2 = "ルーンを増やす";
    SMITH_3 = "ルーンを刻む";
    
    SMITH_10 = "アミュレットに刻めるルーン文字数を増やすのか？";    
    SMITH_11 = "アミュレットに刻める最大ルーン数";
    SMITH_12 = " 文字";
    SMITH_13 = "アミュレットを強化する : ";
    SMITH_131 = "■一文字 ";
    SMITH_132 = "■連続 ";
    SMITH_133 = "■停止 ";
    
    SMITH_14 = "ちょっと待っておれ・・・・キンコンカン♪キンコンカン♪・・・・・・・・・・・・・これでどうじゃ。<BR>続けて増やすのか？";    
    SMITH_15 = "金が足りんぞ・・・。もっと稼いでこい。";
    SMITH_16 = "うむ、今の所はこれ以上アミュレットを鍛えられんな。";
    
    
    SMITH_20 = "どのルーンを増やすんじゃ？";
    SMITH_24 = "ちょっと待っておれ・・・・キンコンカン♪キンコンカン♪・・・・・・・・・・・・・これでどうじゃ。<BR>続けて増やすのか？";    
    SMITH_21 = "ルーンの種類";
    SMITH_22 = "現在の数";
    SMITH_23 = "消費クリスタル";
    SMITH_25 = "クリスタルが足りんぞ・・・。もっと掘ってこい。";
    SMITH_26 = "これ以上鍛えられんぞ。";

    SMITH_30 = "どのルーンを刻むんじゃ？";
    SMITH_34 = "ちょっと待っておれ・・・・・・これでどうじゃ。続けて刻むのか？";    
    SMITH_31 = "ルーンの種類";
    SMITH_32 = "刻み数";
    SMITH_33 = "最大数";    
    SMITH_35 = "これ以上は刻めんよ。";
    
    RUNE01 = "剛撃";//攻撃力★1
    RUNE02 = "鉄壁";//防御力★1
    RUNE03 = "鷹目";//命中率★1
    RUNE04 = "幻影";//回避率★2
    RUNE05 = "百烈";//攻撃速度★2
    RUNE06 = "強欲";//低レベル箱出さない
    //RUNE07 = "一撃";//必殺倍率★4
    RUNE07 = "怠惰";//自動攻撃
    RUNE08 = "俊足";//移動速度★4
    RUNE09 = "賢者";//魔法攻撃★1
    RUNE10 = "障壁";//魔法防御★1
    //RUNE11 = "絶壁";//絶対防御★4
    RUNE11 = "挑戦";//経験値
    RUNE12 = "治療";//状態耐性★4
    //RUNE13 = "治癒";//回復★4
    RUNE13 = "黄金";//ゴールド追加
    RUNE14 = "祝福";//回復速度★3
    RUNE15 = "不倒";//HP★1
    RUNE16 = "精神";//MP★2
    RUNE17 = "吹飛";//吹き飛ばし★2
    RUNE18 = "魔笛";//敵寄せ    
    RUNE19 = "拾得";//拾う    
    RUNE20 = "観察";//観察    
    RUNE21 = "絶壁";//絶壁    
    
    //RUNES = ["剛撃","鉄壁","鷹目","賢者","障壁","不倒","幻影","精神","吹飛", "強欲","祝福","一撃","俊足","絶壁","治癒","百烈","魔笛","拾得"];
    RUNES = ["剛撃","鉄壁","鷹目","賢者","障壁","不倒","幻影","精神","吹飛", "強欲","祝福","怠惰","俊足","挑戦","黄金","百烈","魔笛","拾得","観察","絶壁"];
    RUNE_NAME = [
    "剛撃を刻むと物理攻撃力がアップする。元の値が大きいほどアップする値が増える。",
    "鉄壁を刻むと物理防御力がアップする。元の値が大きいほどアップする値が増える。",
    "鷹目を刻むと命中率がアップする。元の値が大きいほどアップする値が増える。",
    "賢者を刻むと魔法攻撃力がアップする。元の値が大きいほどアップする値が増える。",
    "障壁を刻むと魔法防御力がアップする。元の値が大きいほどアップする値が増える。",
    "不倒を刻むと最大HPがアップする。元の値が大きいほどアップする値が増える。",
    "幻影を刻むと回避率がアップする。元の値が大きいほどアップする値が増える。",
    "精神を刻むと最大MPがアップする。元の値が大きいほどアップする値が増える。",
    "吹飛を刻むと吹き飛ばしがアップする。元の値が大きいほどアップする値が増える。",
    "強欲を刻むとレベルの低い宝箱が出現しなくなる。50刻むごとに効果があがる。",
    "祝福を刻むと回復速度がアップする。",
    //"一撃を刻むと会心倍率がアップする。元の値が大きいほどアップする値が増える。",
    "怠惰を刻むと'AUTO'で自律戦闘を行う。２００ルーン刻まないと効果を発揮しない。<BR>限界突破すると★がつく。",
    "俊足を刻むと移動速度がアップする。<BR>限界突破すると★がつく。",
    "挑戦を刻むと獲得する経験値が増える。ある程度刻まないと効果を発揮しない。",
    //"治癒を刻むと自然回復力がアップする。元の値が大きいほどアップする値が増える。",
    "黄金を刻むと取得するゴールドが増える。",
    "百烈を刻むと攻撃速度がアップする。<BR>限界突破すると★がつく。",
    "魔笛を刻むと敵を呼び寄せる。ある程度刻まないと効果を発揮しない。<BR>限界突破すると★がつく。",  
    "拾得を刻めば刻むほど遠くの宝箱やお金を取得出来るようになる。",
    "観察を刻み敵をタップすると、その敵の情報が表示されるようになる。",    
    "絶壁を刻むと絶対防御がアップする。元の値が大きいほどアップする値が増える。",    
    ];
    
    CRY1 = "クリスタル鉱脈を発見した ";
    
    NOTE1 ="前の勇者が倒れているエリア:";
    NOTE2 ="前の勇者が倒れているステップ:";
    NOTE3 ="前の勇者の武器:";
    NOTE4 ="商店の武器数:";
    NOTE5 ="討伐数";
    NOTE6 ="最大ダメージ:";
    NOTE7="最大レベル";
    NOTE8="総合力:";
    NOTE9="塔階数:";
    NOTE10="迷宮日数:";
    NOTE11="仲間:";
    
    STAGE32_1="不思議な門に入った瞬間、<br>キミはどこかに飛ばされたようだ。";       
    STAGE36_1="不思議な門に入った瞬間、<br>キミは時空の彼方に飛ばされた！";
    STAGE40_1="不思議な門に入った瞬間、<br>キミは時空の彼方に飛ばされた！";
    STAGE63_1="邪悪な気配を感じる・・・";

    STAGE98_1="嫌な予感がする。<br>漂う刺激臭で、キミの目から涙が溢れ出てきた。";    
    STAGE99_1="嫌な予感がする。<br>キミは異様に滑らかな岩を見て身震いした。";       
    STAGE97_1="嫌な予感がする。<br>青白い光が不気味な影を作っている。";    
    STAGE96_1="どこからか不思議な声が聞こえてくる！！<BR>「汝、我より七つの玉を奪い、真の力を見せつけよ！」";    
    STAGE95_1="どこからか不思議な声が聞こえてくる！！<BR>「我が子らの魂よ、ここに集え！！」";    
    STAGE95_2="「ぐ・・・しかし我らはまた転生し、永劫に戦い続けようぞ！」"; 
    STAGE94_1="「よく我が体を集めてくれた！！礼として全力で相手してやろう！！」";    
    
    STAGE115_1="ブォォーーン・・・<br>不気味な音が鳴り響いた！！！<BR>モンスターが集まってくる！";

    STAGE151_1="ドッカーン！！<BR>艦砲射撃だ！";
    STAGE152_1="初心者の館へよくきた！！<BR>・・・本当に初心者じゃろうな？まあよい、ワシを倒せたらキミにプレゼントをやろう。";
    STAGE153_1="ここでは状態異常をおこすスライムが出現するぞ！！<BR>信仰心を上げる事により、状態異常に対抗出来るぞい。";
    STAGE154_1="更におっそろしいスライムを混ぜてみたぞ。<BR>果たしてこの試練を乗り越えられるかな？";
    STAGE155_1="最終ステージじゃ！<BR>もしワシを倒せたら新たなルーンを解放してやろう。";
    

    STAGE_NO_ENEMY = "もう敵の気配がしない・・・";
    STAGE_OUT = "<BR>敵の出現率：";
    
    //STAGE99_2="キミは異様に滑らかな岩を見て身震いした。";       

    RARE="レア度";
    PRICE="値段";
    NEED_MP ="消費MP";
    ATTACK_RANGE ="攻撃範囲";
    WEIGHT="重さ";
    MAX_SPEED ="最大攻撃速度";

    ///全て全角にする
    PUB0 = "■掲示板";
    PUB01 = ["2016/2/12<BR>旅は道連れという事で、雲の世界で倒した相手を仲間にする事が出来るようになりました！<BR>幽体なのでちょっとしたサポートですが、頼もしいですね！",
             "2015/12/26<BR>とうとう大神オーディンが君臨されたようです。倒すと大変なご褒美があるようですが、誰か挑戦者はいませんか？",
             "2015/11/24<BR>たいへんですたいへんです。太古に封印したはずの白竜が目撃されました！まさかあの黒竜まで・・・・",
            "2015/11/19<BR>裏の崖に「初心者の館」なるものが出来たようです！！<BR>私もさっそく行ってみました！！<BR>・・・初心者向け？？",
            "2015/11/01<BR>とうとうこの世界も雲でつながりました！さあて平行世界の向こう側にはどんな人たちがいるんでしょうね？楽しみです。",
            "2015/10/06<BR>んんん？裏の崖から何やらモーモーと鳴き声がしますよ・・・。",
            "2015/9/20<BR>またもや新しい古龍が発見されました！！って古いんだか新しいんだか。",
            "2015/8/15<BR>おめでとう！！ついにバベルの塔を踏破した猛者が現れました！",
            "2015/8/01<BR>むむむ、またもや新しい古龍が発見されました！！",
            "2015/7/22<BR>ニュースです！王様がいきなり王国歴を発布しました！<BR>それに伴い冒険者様たちはいきなり１６才になったようです。<BR>皆さん、若かったんですね。",
            "2015/7/08<BR>なななんと！新たな古龍が発見されたようです。<BR>この刺激臭は・・・？",
            "2015/6/22<BR>王様が建築していた建物は「バベルの塔」と判明！<BR>どうやら格闘場のようです！<BR>もう楽しみましたか？",
            "2015/6/09<BR>ついに目覚めたエンシェントドラゴン討伐の報告が入る。<BR>新たな竜戦士の誕生です！おめでとうございます！",
            "2015/6/03<BR>世界中でチャレンジしているようですが、まだ誰も目覚めた古竜を倒せていないようです！<BR>",
            "2015/5/30<BR>また王様が何か変な物を建造しているようです。<BR>一体なんでしょうね？",
            "2015/5/23<BR>大変です！刺激を受けた事により、伝説のドラゴンが本格的に目覚めてしまいました。<BR>絶対に近づかないようにしてください。",
            "2015/5/20<BR>ついに伝説のエンシェントドラゴン討伐の報告が入る。<BR>偉業達成の冒険者様、おめでとうございます！！"];
    
    PUB1 = "■リンゴを手にする男";
    PUB11 = ["どうも、YamaohGamesです。遊んで頂きありがとうございます！！<BR>日本のどこかでちょっとずつワールド拡張に励んでます。",
             "まあ個人開発のゲームですので、気軽に楽しんでもらえると幸いです！！"];   
             
    PUB2 = "■ミルクを飲む男";
    PUB21 = ["見ない顔だな・・・。<BR>まあ、最初はレベル40を目指してがんばりな。<BR>次の道がひらけるだろうさ。",
             "まず初心者にオススメは戦士だな。<BR>スライムあたりは一撃で倒せるようになるといいぜ。",
             "ついで命中率を上げる為に、狩人にもなっておくといいぜ。<BR>しばらくレベルをあげるとＭＩＳＳもでにくくなるだろうさ。",
             "んで、すぐにやられちまうようなら聖職者だな！！<BR>しんこうしんをあげると、ＨＰの回復量がどんどんとあがるぞ。",
             "で冒険に自信がつくようになってきたら盗賊で宝箱をたくさんゲットしてきな。<BR>お宝を装備するもよし、売ってお金にするもよしだ。",
             "とまあ色々言ってきたが、お前なりの冒険の方法を編み出してがんばるんだな。<BR>レベルがある程度あがると職業も沢山増えるからな。" ,            
             "あとは中央図書館で知識を得てから冒険に出ると生存率がぐっと高まるぞ。<BR>用意周到なヤツほどしぶとく生き残るもんさ。"];     
               
    PUB3 = "■カエルのシャツを着る男";
    PUB31 = ["知っているかい？王が超上位職を解放したそうだよ。<BR>何でもレベル３００が必要らしいぜ。<BR>まあ俺らには関係ないよなあ。",
             "でも円卓の騎士には憧れるよなあ。。。",
             "まあ俺っちには全然関係ないけど、噂によるとレベル１０００を突破した猛者も世の中にはいるそうだ。<BR>１０００を越えるとたまに大量の経験値が必要になるらしい。",
             "上には上の悩みってのがあるんだろうなあ・・・。",
             "そういや最高ランクの武器は、ランク１１の武器を落とす敵がごくまれに持っているらしいぜ。モンスター大全には載らないが、ランク１１を持っているどの敵でもチャンスはあるみたいだぜ。"
             ];       
             
    PUB4 = "■巨大なハンバーガーをかじる男";
    PUB41 = ["むふっ！！<BR>・・・いきなりだが、王様が下位職業のレベルアップを始めたんだと！！<BR>条件はLV300以上、後は各職業によって違うらしい！",
             "お城で★がついている職業がレベルアップ可能な職業だ。<BR>その職業をタップして準備金を払えばいいらしいぜ。<BR>ま、これがべらぼうに高いらしいんだけどな。",
             "んでこれが噂で聞いたレベルアップの条件だ。<br>冒険者・・・敵をたくさん倒す<br>村人・・・やられてもやられても頑張る<br>戦士・・・古竜を倒した証をその手に<br>魔法使い・・・まりょくを高める",
             "聖職者・・・神々へのしんこう<br>狩人・・・きようびんぼう<br>盗賊・・・うんだのみ<br>さむらい・・・速くそして正確に<br>ロード・・・一人で万の敵を倒す",
             "ビショップ・・・賢者を刻む<br>忍者・・・一撃必殺のダメージをたたきだせ<br>旅芸人・・・刻める最大ルーン数を増やす<br>アーマー・・・固いが身上<br>鉱脈研究家・・・クリスタルをあつめろ！"];
    PUB42 = ["むむ、なんということだ！きみはレベル2000を超えたのか・・・。<BR>これらが更なる条件らしいぜ。",
             "名高い冒険者・・・幻の蝶を手に入れるのじゃ<BR>村長・・・無限とも思える輪廻転生<br>竜戦士・・・黒竜討伐の証<BR>魔導士・・・暗黒3武器の所持<br>高位司祭・・・迷宮にて100日の修行",
             "レンジャー・・・月の女神の力をその手に<br>盗賊頭・・・秘宝をかかげるのじゃ<br>侍大将・・・むらまさ<br>マスターロード・・・一騎当百万<br>賢者・・・賢者を極める<br>影・・・4×8を超えろ",
             "宮廷道化師・・・笛を極めてドラムを叩け<BR>フルアーマー・・・鉄壁を極める<br>地脈研究家・・・希少な天駆ける翼<br>魔人・・・魔神の爪先に対抗しろ<br>円卓の騎士・・・バベルの塔をひたすら昇れ",
             "気闘士・・・百烈を極めろ<br>機装騎士・・・古代の禁呪を装備する",             
            ];                     
             
    PUB5 = "■眠そうな旅人風の男";
    PUB51 = ["ふうむ、この島にはなかなか強い魔物が出るようだなあ。 <br>これからの戦いでは敵の事を知らないと厳しくなるだろうなあ。",
             "まず敵も冒険者と同じようにステータスを持っている事を頭に入れておくんだ。<br>攻撃力や防御力、回避率や命中率だな。",
             "だから例え命中率が100%以上でも敵がそれ以上の回避率を持っていれば攻撃は当たらないし、堅くてダメージが与えられない敵もいるだろう。",             
             "ただ逆を言えばどんな相手でもお前さんが強くなれば、いつかは圧倒出来るってことさ。",
             "ま、自分の可能性を信じてがんばる事だ。",             
             ];    

    PUB6 = "■顔が真っ赤な男";
    PUB61 = ["俺のじいさんに聞いた話だがなあ、このファンタジアはありとあらゆる場所につながっているんだと。",
             "つまりここで一番強いって事は、この世で一番てことになるのかもな。",
             "昔は人間があの古竜たちを使役してたって話だからな。<BR>昔は人間族が一番強かったのかもな。",
             "そういや大昔ここら辺で人間族同士の大きな戦があったらしい。<BR>伝説じゃあ、たった一人のよそ者が戦を終わらしてしまったらしいぜ。<BR>一体どんなヤツだったんだろう？"
             ];  

    PUB7 = "■ヴァルハラの門番";
    PUB71 = ["プハー。仕事終わりの一杯は格別だな！<BR>なに？ヴァルハラについて知りたいだと？",
             "ヴァルハラってのは戦いで倒された者達が死後に訪れる天上の楽園さ。<BR>大神オーディンの居城もある。",
             "ヴァルハラに訪れる魂の数が増えれば増えるほど、その想いが人間界に引き寄せられて、ファンタジア上空に現れる事が多くなるんだ。",
             "ただ人間が一度ヴァルハラを訪れると、魂達が満足してしまうのでまた人間界から遠ざかってしまうんだよ。",             
             "またヴァルハラにはオーディンのペット達がうじゃうじゃいるんだが、人間達には宝の山に見えるだろうな！<BR>まあ好き放題しているとすぐにヴァルキリー達が飛んでくるから気をつけろ！！",
             "まー、ちゃーんと入場料を払えば俺が安全にヴァルハラまで送り届けてやるよ。",
             "とうとうオーディン様が降臨されたぞ！<BR>最大レベルまであげれば挑戦する権利を得るだろう。<BR>勇敢なる愚か者にヴァルハラの祝福を！"
             ];  
    PUB72 = ["おおっと！！そろそろ仕事の時間だな・・・。"];        
             
    PUB8 = "■お祭り男";
    PUB81 = ["ふー、40才を超えると肉体的に衰えがくるぜ。<BR>早く自分の道場を開いて、後継者を見つけたいもんだ。",
             "そいうえばレベル1000を超えると道場主に挑戦する事が出来るらしいぜ！<BR>お互いがんばろうな！",
             "あ、最近は祭の日に珍しいモンスターが出没するそうだ。<BR>十分気をつけろよ！"
             ];  
             
    PUB9 = "■銀髪隻眼のしぶい男";
    PUB91 = ["貴様・・・・なかなかいい眼をしているな。<br>常に何かを追い求めている、そんな眼だ。<br>各地の伝説の話には興味があるか？",
             "冬、雲を突き抜けた山の上の奥深く、冒険者を究めた者のみが目にする、そんな蝶がいるという。<br>ただし同時に凶悪な悪魔も呼び寄せるらしい。貴様にそれを追い求める勇気があるか？",
             "遥か太古、我らの祖先の一人が古竜達の母竜を封印し、竜達の力を大幅に弱めたという伝説がある。<BR>またその時に父竜を隠す為、古竜達がその体を６つの秘宝として隠したらしい。<BR>まあ伝説だがな。",             
             "さて何も言わなくとも貴様は行くのだろう。気をつけるのだぞ。"
             ]; 
             
    PUB10 = "■メガネをかけた男";
    PUB101 = ["何か新しい話はないか？<BR>常に新しい物事を追いかける、それが俺のポリシーさ。",
             "噂によると白古竜は子供達である古竜を呼び寄せるらしい。<BR>しかもその古竜達には継承能力があるらしいぜ。とんでもねえな。",
             "噂によると「最果ての地」では、人により見える星の数が違うらしい。さて全ての星を見る事が出来る人間がいるのだろうか。",             
             ];                 

    //TOWER1="ただいま建築中！";
    TOWER1="ここはバベルの塔。ファンタジアの闘技塔だ。<BR>キミも腕に自信があるなら最上階を目指すといい。<BR>まあ、まだ試験運用中だがね。";
    TOWER11="現在のランク：";
    TOWER20="エントリーする";
    TOWER30="ルール";
    TOWER31 = ["このバベルの塔はファンタジア中から集まった冒険者たちが腕を競い合う闘技場だ。<BR>勝てばランクが上がり、負ければランクが下がる。<BR>上位ランクになればなるほど報酬も大きくなるぜ。",
             "エントリーしたら控室で準備を整えるんだ。<BR>相手をよく観察して装備を選べ。<BR>まあ、負けても本当に死なねえから安心しな。<BR>ゴールドは半分失うけどな！",
             "もしも勝利したら獲得したクリスタルを次の対戦に持ち越せるぜ。<BR>連勝していけばその分多くのクリスタルを獲得出来るぞ。",             
             "あ、ごくまれに相手の装備を取得できるらしいぜ・・・。<BR>まあ同じ程度で自分の装備を失う事もあるんだけどな・・・。<BR>さあ、より高い階層を目指してがんばってきな！！"     
             ];         

    TOWER_B1="バベルの塔";
    TOWER_B2="ギブアップする";
    TOWER_B3="対戦開始！！";
    TOWER_B4="キミは対戦に勝利した！";
    TOWER_B5="終了";
    TOWER_B6="キミは対戦に負けてしまった・・・。";
    TOWER_B7="ランクが ";
    TOWER_B8="にあがった！";
    TOWER_B9="にさがった！";
    TOWER_B10="対戦控室";    
    TOWER_B11="対戦相手の情報だよ。準備はいいかい？";    
    TOWER_B12="対戦を始める";    
    TOWER_B13="棄権する";    
    TOWER_B14="キミは装備をうしなった！";
    TOWER_B15="続ける";   
    TOWER_B16="連勝数：";
    TOWER_B17="報酬クリスタル：";      
    TOWER_B99="キミは塔の頂点へと昇りつめた。本当におめでとう！！<BR>Thank you for playing!!"; 
    
    //< 40
    TOWER_ENEMY1=["初心者の","駆け出しの","気持ちの焦った","頭でっかちの","病弱な","うわのそらの","適当な","勉強好きな","漆黒の","紅蓮の","引っ込み思案の",
    "新雪の","眼鏡が似合わない","恩着せがましい","緊張した","爽やかな","すばしっこい","春秋に富む","徒歩通勤の","春風の","半泣きの","ピカピカの","猫に育てられた"];
    //< 300
    TOWER_ENEMY2=["自由な","気合いの","派手好きの","悲しみの","無情の","神経質な","一発屋の","思慮深い","天鵞絨色の","山吹色の","見た目より強い","風呂嫌いな","方向音痴な",
    "ほろ酔い","見栄っ張りな","ソフトマッチョの","みそっかすの","ものぐさな","瘦せっぽちの","ピチピチの","優柔不断な","犬に育てられた","新進気鋭の","明日結婚式の"];
    //< 2000
    TOWER_ENEMY3=["勇猛な","豪傑の","精密な","頭でっかちの","熟練の","暁の","適当な","勉強好きな","冷静な","高速の","萌黄色の","シルバー色の","腕っぷしの","どこか影のある","胃下垂の",
    "石橋を叩く","鬱屈した","恩知らずな","川流れの","潔癖症の","減点主義の","自転車通勤の","灼熱の","神出鬼没の","前後不覚の","つんつるてんの","鉄面皮の","とにかく頑丈な","仏頂面の",
    "有言実行の","行く当てのない","酔いどれ","山羊に育てられた"];
    //<  
    TOWER_ENEMY4=["神域の","光速の","音速の","愛に生きる","負けなしの","奇跡の","進撃の","悪魔的な","伝説の","孤高の","江戸紫色の","若草色の","銀閃の","物腰の柔らかい","指示待ちの",
    "獅子殺しの","轟く雷鳴","栄養満点の","空前絶後の","恋に恋する","天使の笑顔の","狂乱の","龍に育てられた","女神に愛された","不死と噂の","一撃必滅の","貴方を待っていた","威風堂々たる",
    "勅命を帯びた","百花繚乱の","無限の","天に選ばれた","神をも欺く","闇に追われる","棺桶を背負った","離婚調停中の","慙愧の","驚天動地の","千里眼の","千変万化の"];
    
    YES = "■はい";
    NO = "■いいえ";
    
    STATE = "状態：";
    STATE_STN = "石";
    STATE_PAR = "麻";
    STATE_SLP = "眠";
    STATE_DED = "猛";
    STATE_POI = "毒";    
    
        
    PHY = "物理";
    MGC = "魔法";
    HITP = "命中";
    
    ATR = "属性";
    ATR1 = ["ノーマル","物理無効","物理反射","魔法無効","魔法反射","遠距離無効","必殺無効","特殊","模写","逃走","ダメージ半減"];
    

    WAL10 = "ここは戦いに敗れた勇者やモンスター達の魂が眠るヴァルハラの入り口だ。<BR>ヴァルハラへ昇るかね？";
    WAL11 = "入場料";
    WAL12 = "おお、入場料も持ち合わせておらんのか！<BR>オーディンのご加護あれ！";
    WAL21 = "どうやら大神オーディンは留守のようだ。<BR>稼ぐなら今のうちだ！！";
    WAL22 = "我を倒せ！さすれば汝の潜在能力を引き出してやろう！";

    DOJO01 = "ここは道場じゃ。<BR>もしワシにかてばこの道場を譲ってやろう！！";
    DOJO02 = "キミはここの道場主だ。<BR>新たな冒険者に継承をする事が出来る。";    
    DOJO03 = "ほう・・・久しく見ない間に強くなったな！<BR>ようし、全力で挑んでくるがいい！！";    
    DOJO04 = "ふむ、まだワシに挑戦する資格がないようだな！<BR>もっと修行してからくるがよい！";      
    DOJO10 = "継承ルール";
    DOJO11 = ["道場破りに成功すると、道場主になる事が出来ます。<BR>道場では次の冒険者に能力を継承する事が出来ます。<BR>継承すればするほど引き継げる能力値がアップしていきます。",     
             "引き継がれる内容は以下の通りです。<BR>・継承回数<BR>・能力値×レベル係数＋継承回数のボーナス<BR>・[E]そうび、タックボル商店の武器<BR>・アミュレット、ルーン<BR>・職業レベル(職業ポイント10000以上)<BR>・その他図鑑や記録",
             "引き継がれない内容は以下の通りです。<BR>・レベル、経験値<BR>・年齢<BR>・ゴールド、クリスタル、[E]以外そうびリスト<BR>・職業レベル(職業ポイント10000未満)<BR>",
             "継承自体は何世代も行う事が出来ますが、一度継承すると前の冒険者は引退してしまいますので、くれぐれもご利用は計画的に！",
             "また継承した場合、次の道場主は前の冒険者になります。<BR>これを撃破しないと道場は引き継げません。<BR>がんばってください。"
             ];    
    DOJO12 = "道場主に挑戦をする";             
    DOJO13 = "キミは道場破りに成功した！！<BR>キミは新たな道場主となった！！";          
    DOJO14 = "キミは道場破りに失敗した！！<BR>お金をとられて町に放り出されてしまった！";      
    DOJO15 = "道場主のステータス確認";      
    DOJO16 = "これが現在の道場主のステータスだ。";            
             
    DOJO20 = "継承を行う(継承画面へ移動)";
    DOJO21 = "上のステータスで継承をする<BR>　(ボーナスは持ちこせません)";    
    DOJO22 = "前回ボーナス";    
    DOJO30 = "継承が終了し、新たな冒険者が誕生した！！<BR>今までのキミ、本当にお疲れさまでした！！";    
    DOJO31 = "もはやキミの能力を継承出来る者はいないだろう・・・今後はキミ自身を鍛えるのだ。";    
    
    MINO01 = "モーモーモー！（私の迷宮へよくきた！）<BR>モフモフモフ？（迷宮に入るのか？）";
    MINO10 = "迷宮";
    MINO11 = "迷宮に入る";
    MINO12 = "入場料";
    MINO13 = "日目";
    MINO14 = "最高日数:"; 
    MINO15 = "モーモーモー！（金たりないぞ）";    
    MINO30 ="ルール";
    MINO31 = ["この迷宮ではこれまでに倒したモンスター達と戦う事が出来るモフ。<BR>ただしこの迷宮内では時間の流れが速くなるので利用しすぎに注意が必要だモー。",
              "これがこの迷宮のルールだぞ。<BR>・敵が無制限に出現<BR>・宝箱、ゴールドは落とさない<BR>・一定時間で敵が強化<BR>・死んだら即セーブ<BR>・奥地ほど時間の流れが早い",
              "日にちが経つと敵が強くなるので、何日いれるかチャレンジしてみるといいモー。<BR>また奥地には強大な敵を召還してあるモ。がんばるモ。",
              ];   
    MINO21 = "キミはミノタウロスの迷宮から生還した！！";    
    MINO22 = "日数";    
    MINO23 = "ステップ数";    
    MINO24 = "討伐数";    
    MINO25 = "報酬ゴールド";
    MINO26 = " カウント";
    MINO27 = "報酬クリスタル";
    MINO28 = "報酬倍率";
    MINO41 = ["「ふははは。よくここまできた！軽く相手してやるわ！」",
    　　"「ふははは。さっきはつい油断したぜ。ちょっと本気をだしてやるか！」",
    　　"「ふははは。実はさっきはお腹の調子が悪かったんだよね。さてやってやるぜ。」",
    　　"「ふははは。貴様なかなかやるな～。しかしそれもここまでの話。牛王拳をみせてやる。」",
    　　"「ふははは。さっきの牛王拳は久々だったからな。これが真・牛王拳だ！！くらえ！！」",
    　　"「ふははは。ぐぐぐ・・・もはや手加減はしない。３倍牛王拳だ！！」",
    　　"「ふははは・・・はは。もはや笑えん。真の牛の力を見るがいい！」",
    　　"「とうとう俺を本気にさせたか。牛魔王として貴様を倒す！！」",
    　　"「・・・もはや語る言葉もなし！！死闘を演じようぞ！」",
    　　"「ついに・・・これで最後だ。牛王の先祖たちよ！俺に力を授けよ！！」"
　　];              
    MINO42 = [
        "「あーれー」",
        "「戦略的転進だ！！」"
    ];
    
    CLD10 = "ここでは雲の世界を通じて、他の世界とつながる事ができるぞ！<BR>まだまだ試作段階じゃがな！<BR>※この機能を利用するには通信可能な状態である必要があります。";
    CLD11 = "データを雲の世界に送る";
    CLD12 = "世界ランキング(TOP100)";
    CLD13 = "▼ゆうしゃの名前";
    CLD14 = "名前を入力してください！";
    CLD15= "8文字以下で入力してください！";
    CLD151= "パスワードは、6文字以上10文字以下<BR>で設定してください！";
    CLD16 = "※サーバーにセーブデータが送信されます<BR>ランキングとバックアップなどに利用されます<BR>バックアップを利用しない場合、パスワードは必要ありません";
    CLD17 = "実行しました！";
    CLD18 = "その名前は既に登録済みのため使用出来ません！";
    CLD19 = "通信エラーが発生しました！";
    CLD20 = "通信中・・・";
    CLD21 = "削除しました！";
    CLD22 = "失敗しました！";
    CLD23 = "順位";
    CLD24 = "総合力";
    CLD25 = "なまえ";
    CLD251 = "(タッチで詳細)";        
    CLD26 = "レベル";
    CLD27 = "継承数";
    CLD28 = "塔階数";
    CLD29 = "迷宮日数";
    CLD30 = "ID=";
    CLD31 = "サーバーのデータを消す";
    CLD32 = "データを送る";
    CLD33 = "キミのランキング：";
    CLD34 = "更新";
    CLD35 = "日前";
    
    CLD40 = "雲のデータで生まれ変わる";
    CLD41 = "▼雲のゆうしゃのID";
    CLD42 = "▼雲のゆうしゃの名前";
    CLD43 = "▼パスワード(バックアップ用)";
    CLD44 = "※ID、名前、パスワードが一致したデータを取得し<BR>確認画面を表示します";
    CLD45 = "データを確認する";
    CLD46 = "全ての項目を入力してください！";
    CLD47 = "対象のデータが見つかりませんでした！";
    CLD48 = "対象のデータが見つかりました。";
    CLD49 = "データ確認画面へ移る";
    CLD50 = "生まれ変わる<BR>(現在のプレイヤーデータに上書きされます)";
    CLD51 = "キミは新しく生まれ変わった！！";
    
    CLD52 = "雲のゆうしゃ詳細";
    CLD53 = "雲のゆうしゃに決闘を申し込む<BR>(テスト版)";
    CLD53_1="雲の決闘場";
    CLD53_2="ギブアップする";
    CLD53_3="対戦開始！！";
    CLD53_4="キミは対戦に勝利した！";
    CLD53_5="終了する";    
    CLD53_6="キミは対戦に負けてしまった・・・。";    

    RACE = "種族";
    RACE_A = ["スライム","妖魔","人間(物理)","不死","物質","妖精","竜","野獣","精霊","獣人","魔獣","天使","巨人","悪魔","人間(魔法)","半神","魔導","希少","女神","天神","魔神","小人","マシン","古竜"];
    ENEMY_ATTACK1 = "の";
    ENEMY_ATTACK3 = "会心の";    
    ENEMY_ATTACK2 = "ダメージ！！";
    ENEMY_ATTACK4 = "猛毒の";    
    ENEMY_ATTACK5 = "毒の";        
    
    TYPE_L = "タイプ";
    TYPE_1 = "物理";
    TYPE_2 = "魔法";    
    
    ACCESSSORY_ITEM = ["物理防御力","魔法防御力","ダメージカット","会心中和率","移動速度","レアアイテム出現率","自然回復力","自然回復速度"];    
    
    PARTY1 = "が仲間になりたそうにこちらを見ている。仲間にしますか？";
    PARTY11 = "■仲間にする（現在の仲間と別れます）";
    PARTY12 = "■仲間にしない";
    PARTY13 = "■仲間と別れる";
    PARTY14 = "仲間ステータス";

    setJobLanguage();
    setWeaponLanguage();
    setEnemyLanguage();
    setAccessoryLanguage();

}

function setENG(){
    GAME_NAME = "FANTASYMASTERRPG";
    FANTASIA_REKI ="";
    FANTASIA_YEAR ="Years";
    FANTASIA_DATE ="Days";    
    DATE_COMMNET=["A Happy New Year!! <BR>And Happy birth day!!",
                "Today's the day of the FANTASY festival.<BR>Fantastic dance around the torch is being carried out.",
                "Today's the day of the KING DRAGON festival. <BR>Here and there in the dragon steak is served.",
                "The last day of the year the town in preparation to welcome the New Year.",
                "The beginning of a long adventure from today!!<BR>First of all, good to collect the information in the PUB."];    
    
    TWEET_L = "Tweet Adventure status";
    ONLINE_L = "ONLINE test";    

    NEXT_L = "NEXT▶";
    RETURN_L="◀RETURN";
    BACK_L="◀BACK";
    RETURNTOWN_L="◀TOWN";
    NEXT_STAGE_L="NEXT▶";    
    PROLOG_L="Welcome to darkness island 'Fantasia'."+"<br>"
            +"Only one thing that you should discover legendary weapon 'FantasyMaster', then you prove your strength!!"+"<br>"
            + "From me to try to present the magic amulet to you." + "<br>"
            +"Now, starting on an adventure after preparing in the town!";
    BONUS_T="Create first character";
    NAME_L="NAME";
    WEAPON_L="WEAPON";
    TAKE_L="TAKE OVER";        
    AGE_L="AGE";     
    ITEM_L="ITEM";      
    JOB_L="JOB";
    EQUIP_L="WEAPON EQUIP"; 
    EQUIP_A_L="ACCESSORY EQUIP";     
    CHANGE_L="[E]⇔[SUB]";  
    CHANGE2_L="Remove EQUIP";
    LEVEL_L="LEVEL";
    STATUS_L="STATUS";
    JOB_POINT_L="JOB POINT";    
    RECORD_L="RECORD";  
    OUT_SET_L="CHAR OUTPUT OPTION";   
    OUT_SET_A = ["adventurer damage", "enemy damage", "recovery of adventurers HP", "recovery of adventurers MP", "recovery of enemy HP", "adventurer evasion", "enemy evasion","experience","treasure box","gold","crystal","enemy appearance message","boss appearance message","defeat message","level-up message"];    
    
    ST1_L="STR";
    ST2_L="AGI";
    ST3_L="DEX";    
    ST4_L="STA";
    ST5_L="MAG";
    ST6_L="FAI";
    ST7_L="LUC";    
    ST8_L="Bonus";
    EXP_L="EXP";
    GLD_L="GOLD   ";
    CRY_L="CRYSTAL";            
    
    DT1="attack";
    DT2="defense";
    DT15="hit rate";
    DT3="evasion rate";
    DT4="attack speed";
    DT5="critical rate";
    DT6="critical damage";
    DT7="move speed";
    DT8="magic power";
    DT9="magic defense";
    DT10="absolute field";
    DT11="state tolerance";
    DT12="HP";
    DT13="MP";
    DT14="regenerate";
    DT16="push power";
    DT17="absolute attack";
    DT18="available weight";        
    DT19="regenerate spd";
    DT20="CLASS";  
    DT21="class";      
    SPECIAL_L = "Type";
    //WEAPON_TYPE_L =["近接","農具","刀","盾","遠距離","中距離","回復","魔法攻撃","秘宝","治療","移動","奥義","忍具","楽器","防具","聖剣","機械","七つ道具","召還","ダウジング","神器"];
    WEAPON_TYPE_L = ["close-range", "farm item", "katana", "shield", "long-range", "medium-range", "recovery", "magic attack", "treasure", "treatment", "move","special", "Ninja item", "musical instrument", "armor", "holy weapon", "machine", "Seven Tools", "summon", "dowsing", "sacred"];
    //熟練度+
    WEAPON_TYPE_P_L =["attack","attack","critical damag","evasion rate","hit rate","attack","regenerate","magic power","absolute attack","state tolerance","defense","attack","critical rate","attack","defense","regenerate","hit rate","evasion rate","hit rate","hit rate","critical damag"];
    JOB_SPECIAL_L = "Type&Effect";
    JOB_TYPE_L =["attack","attack&defense","critical rate","evasion rate","hit rate","attack","regenerate","magic power","rare enemy","state tolerance","move speed","absolute attack","critical damage","push","attack","absolute field","attack","rare weapon","magic power","crystal","absolute attack"];
    POINT = "point";
    WEAPON_COUNT = "Level of skill";
    
    WHAT_COMMENT = "What would you do?";
    WHAT_COMMENT2 = "Ahead,hell. <BR>Be careful!! HP does not recover this place. ";
    WHAT_COMMENT3 = "Star in the night sky glowing...";    
    
    TOWN_T="Fantasia";
    GATE_T="Outskirts";
    GATE2_T="Outskirts of the cliff1 (detour)";    
    GATE3_T="Outskirts of the cliff2 (detour)";    
    GATE4_T="Farthest land";        
    ENDING = "You got all of this world. I will bestow the title of Fantay Master.<BR>"+
    "Thank you for playing!!<BR>"+
    "By Yamaoh Games";
    
    ENDING2 = [ "Arrival star", "Weapon star", "Job star", "Defeat star", "Damage star", "Level star", "Tower star", "Inheritance star" , "General star", "Gold star", "Crystal star", "Enemy star"];
    //ENDING2 = ["到達の星","武器の星","職業の星","討伐の星","ダメージの星","レベルの星","塔の星","継承の星","総合の星","ゴールドの星","クリスタルの星","敵の星"];


    CASTLE_T="Fantasia Castle";    
    PUB_T="PUB　OSACOLE";    
    WEAPON_T="Weapon Shop Takuboru";    
    TEMPLE_T=" Central Library";        
    INN_T="INN Moon Drop";
    SMITH_T="Old dwarf Blacksmith";
    TOWER_T="Babel Tower";    
    WAL_GATE_T ="The entrance to the Valhalla" ; 
    CLOUD_T="World of cloud";      
    DOJO_T="Dojo";
    DOJO2_T="Dojo(set)";    
    DOJO3_T="Dojo(complete)";   
    DOJO4_T="Dojo Master Status";   
    PARTY_T = "To fellow";    
    
    STAGE0="Fantasia prairie";
    STAGE1="North of the desert ";
    STAGE2="Fairy valley";
    STAGE3="Phantom of the lake";
    STAGE4="South of the snow";
    STAGE5="Heavenly road";
    STAGE6="Unexplored region";
    STAGE7="Sea of silence";    
    STAGE8="Floating island";
    STAGE9="Ancient battlefield(1)";
    STAGE10="Ancient battlefield(2)";
    STAGE11="Ancient battlefield(3)";
    STAGE12="Hell gate";    
    STAGE13="Hell";  
    STAGE14="Deep Hell";
    STAGE15="Hell Palace";    
    STAGE94="Dragon altar";    
    STAGE95="Cave of sealed";                
    STAGE96="Cave of cloud";            
    STAGE97="Cave of blue light";      
    STAGE98="Cave of rubber";        
    STAGE99="Cave of enamel";
    STAGE100="Cave of monster";   
    STAGE104="Magic academy";
    STAGE108="Village of the Giants";
    STAGE112="Paradise of Beastman";       
    STAGE116="Country of Shura";    
    STAGE120="Palace of Count";        
    STAGE124="Treasure house";   
    STAGE128="Hidden village";  
    STAGE132="Majorica";        
    STAGE136="Archer of the feast";
    STAGE140 = "The island of east";
    STAGE144 = "Small Kingdom";    
    STAGE148 = "Mega soldiers plant";
    STAGE152 = "Beginner's house";    
    STAGE993 = "Odin palace";            
    STAGE994 = "Odin palace(entrance)";        
    STAGE995 = "Odin palace(garden)";    
    STAGE996 = "Odin palace(gate)";    
    STAGE997 = "Valhalla(deep)";
    STAGE998 = "Valhalla(middle)";
    STAGE999 = "Valhalla(entrance)";    
    STAGE1010 = "Minotaur Labyrinth";    
    
    STEP=" steps";
    
    STAGE_CLEAR_L = "You was able to here in the camp." + "<br>"
        + "Do you want to go back to town?" + "<br>"
        + "Or do you proceed?" + "<br>";
        
    STAGE_CLEAR_L2 = "You arrived to the deepest!" + "<br>"
        + "The found a new adventure destination." + "<br>"
        + "Return to the city." + "<br>";

    STAGE_CLEAR_L3 = "You arrived to the deepest!" + "<br>"
        //+"Wow it to come up here in this game balance! Very pleasure you ... and give me a comment to the developer on app page."+"<br>";        
        + "Please followed by the development !!" + "<br>";      
        
    STAGE_CLEAR_L4 = "You arrived to the deepest!" + "<br>"
        //+ "The found a new adventure destination." + "<br>"
        + "Return to the city." + "<br>";
        
    STAGE_CLEAR_L5 ="Go to the same adventure";        
    
    GAMEOVER_L = "You died!" + "<br>"
        + "But a pity, get to eternal sleep is left to the next brave thing after." + "<br>"
        + "";       
        
    GAMEOVER_L2="■Between reincarnation"+"<br>"
        +"Thou, or want a reincarnation？"+"<br>"
        +"";    
        
    CASTLE_L = "Adventurer, came well." + "<br>"
        + "Will you want to get in any job?" + "<br>"
        + "";
        
    CASTLE_L2 = "Alright, You from now "
        + "";
        
    CASTLE_L3 = "!!" + "<br>"
        + "Work hard for new job!" + "<br>"
        + "";
    CASTLE_L4 = "Want to raise the Job level?" + "<br>"
        + "It's necessary is this reserve!" + "<br>"
        + "";
    CASTLE_L5 = "Well, I will give the level of this Job!" + "<br>"
        + "Gods blessing of Fantasia!!" + "<br>"
        + "";
    CASTLE_L6 = "Hmm, Maybe next time." + "<br>"
        + "";
    CASTLE_L7 = "Reserve seems unexpected enough. The Come fresh start." + "<br>"
        + "";          
     
    PUB_L = "Welcome!! " + "<br>"
        + "To talk to someone?";        
    SMITH_L="It's what like?"+"<br>"
        +"I'll engrave a rune if there is Crystal."+"<br>"
        +"";        

    WEAPON_STORE_L="Welcome! Today, what will you do it?"+"<br>"
        +"";
    WEAPON_STORE_L2="!!<BR>"+"<br>"
        +"";
    WEAPON_STORE_L3="Hey, it seems not have in full is equipped with it more?"+"<br>"
        +"";
    WEAPON_STORE_L4="!!<BR>It looks like gold is not enough to buy."+"<br>"
        +"";
    WEAPON_STORE_L5=",Do you buy this?"+"<br>"
        +"";     
    WEAPON_STORE_L6="Hey, Is not nothing have what to sell."+"<br>"
        +"";                
    WEAPON_STORE_L7=",Is it me sell this?"+"<br>"
        +"";                
    WEAPON_STORE_L8="What do you buy?"+"<br>"
        +"";             
    WEAPON_STORE_L9="What do you sell?"+"<br>"
        +"";  
    WEAPON_STORE_L10="I can't buy weapons that are equipped with."+"<br>"
        +"";  
    WEAPON_STORE_L11="!!<BR>This is the last one！"+"<br>"
        +"";        
    WEAPON_STORE_L12="!!<BR>Do you sell something to the other?"+"<br>" ;  
    
    WEAPON_STORE_L13="SELL ALL(Without equip)" ; 
    
    WEAPON_STORE_L14="!!<BR>You are all job master!!"+"<br>"
        +"Yes,I will replenish this weapon.";  
        
    WEAPON_STORE_E01="Thank you for buying ";
    WEAPON_STORE_E02="Thank you for selling ";
        
    TEMPLE_L="Welcome to the Central Library."+"<br>"
        +"Do you read any book?"+"<br>"    
        +"";        
    INN_L="You're Mr.villagers!"+"<br>"
        +"I do not need the money, it is going to stay!"+"<br>"
        +"Your HP and MP was complete recovery!!"+"<br>"
        +"";
    INN_L2="Cheers for good work!"+"<br>"
        +"Do you go to stay?"+"<br>"
        +"";    
    INN_L3="Do not have enough money. Take sleeping outside."+"<br>"
        +"";         
    INN_L4="Good night ... Good morning!"+"<br>"
        +"Your MP has a full recovery! !"+"<br>"    
        +"";         
    INN_L5="Good night ... Good morning!"+"<br>"
        +"Your HP has a full recovery!!"+"<br>"    
        +"";         
    INN_L6="Good night ... Good morning!"+"<br>"
        +"Your HP and MP was complete recovery!!"+"<br>"    
        +"";      
    INN_L7="Oh, Mr.mayor!!"+"<br>"
        +"I don't need the money, please going to stay here!!"+"<br>"
        +"Your HP and MP was 200% complete recovery!!"+"<br>"
        +"";         
    INN_L8="Oh, Mr.Prime minister!!"+"<br>"
        +"I will guide you to the much-valued Royal Suite!"+"<br>"
        +"Please, began to slowly taking everyday tired!"+"<br>"        
        +"Your HP and MP was 1000% complete recovery!!"+"<br>"
        +"";                
    GATE_L="Where are you going?<br>";  
    GATE_L2 = "There is label called 'Beginner do not enter!!'<br>";
    GATE_L3 = "There is label called 'Wanted challenger!!'<br>";    
        
    //TITLE1 = "β ver(This version is in development)";
    TITLE1 = "";  
    SETTING ="■Note";
    TOTITLE = "■TO TITLE";
    TOTITLE1 = "Do you really return to the title?";  
    COMFIRM1 = "Are you sure you want to do?";    
    BUY ="■BUY";
    SELL ="■SELL";
    STAY ="■STAY";
    STAY1 ="Stable";    
    STAY11 ="Stable(Nights)";        
    STAY2 ="Futon Room";        
    STAY3 ="Single Room";
    STAY4 ="Deluxe Room";     
    STAY5 ="Executive Room";     
    STAY6 ="Long Stay";        
    DONTBUY ="■Don't BUY";
    DONTSELL ="■Don't SELL";
    GOLD ="GOLD:";
    CRY ="CRYSTAL:";        
    OVER_YES ="■Reincarnation (takeover)";
    OVER_NO ="■No Reincarnation (no takeover)";
    OVER_NO_COMMENT ="Is it to do so?";
    PLAYER_NAME =" times brave";
    PLAYER_NAME2 =" times ";

    STAGE_START = "Let's start the adventure!";
    ENEMY_START = " has appeared!";
    ENEMY_END = " defeated.";
    ENEMY_RUN = "ran away!";    
    LEVELUP1 = "Your level up!";
    EQUIP1 = "■Throw away in main equip";
    EQUIP11 = "Are you sure you want to throw away?";        
    EQUIP2 = "The horrible it and throw away the bare hands!";
    EQUIP21 = "You are not equip an accessory!!";    
    BAIRITU = "Magnification";
    
    
    BOOKS= ["■Job book","■Status book","■Weapon book","■Monster book","■Rune book","■How to play"];
    BOOK1="Do you read any item?";
    BOOK01=" <BR>[LEVEL UP]";
    BOOK11=["STR","AGI","DEX","STA","MAG","FAI","LUC"];
    BOOK12 = [
    "When STR is increased, increases attack and absolute attack.Also it will be able to handle the heavy weapon.",
    "When AGI is increased, increases evasion rate and move speed and attack speed.",
    "When DEX is increased, increases hit rate and critical rate and critical damage.",
    "When STA is increased, increases defense and maximum HP.Also it will be able to handle the heavy weapon.",
    "When MAG is increased, increases magic power and absolute attack and magic defense and  maximum MP.The faster the casting of spells.",
    "When FAI is increased, increases absolute field and state tolerance and regenerate and maximum MP.",
    "When LUC is increased, increases hit rate and critical rate, also items are more likely to appear when you have defeated the enemy."
    ];
    BOOK31 ="KILL NUM";
    BOOK51 = ["Preparation in the town", "Job", "Buy weapons", "Adventure","About save","Kingdom year & age", "Attack range", "Job point", "Weapon level of skill","Accessory","Fellow","Data transfer"] ;
    BOOK501 = ["First, let's prepare for adventure in the town.",
            "In the castle you can choice the job. It is possible to change jobs many times Let's choose the time met the profession. <BR>In addition will increase Jobs when it reaches the some level.",
            "In pub, let's elicit a variety of information. <BR>Everyone will tell you kindly.",
            "In INN, you can recover HP and MP by lodging. If job is the villagers ....",
            "Central Library will be able to obtain a wide range of knowledge in. <BR>If you have that you want to add here, please request the addition of a new book YamaohGames.",
            "You can buy and sell weapons in the Weapon Shop. <BR>Although it is ridiculous shopkeeper and that sell at double the amount of buying value, in fact, this shopkeeper has written a Weapon book. ",
            "Is a blacksmith makes carved runes in the old dwarf is magic amulet. <BR>More information in the chapter 'Rune'. ",
            "Tower of Babel is a building that was built on a whim king. Is still details are unknown.",
            "From the outskirts, you can go on an adventure. <BR>When you clear we are increasing gradually and adventure can be first.",
            "Outskirts (detour), you can challenge the stage not related to the main root. <BR>It would be better to initially stay away even since opponent is strong to say that."
            ];
    BOOK511 = ["By the king be appointed in the castle, you can get to various Jobs.",
            "By Job, skills to activate and the status up to the time of level up will change. <BR>More information, please look at 'Job book'. ",
            "I heard when anything reaches the level 40 and 300, new job is released. <BR>Job of to further reach to 300 this becomes possible level up.",
            "The Job point you accumulate enough to defeat the enemy with the Job. When the Job point is greater than 10000 will be able to take over the Job level!Furthermore special effects due to compatibility of occupation and weapons are exhibited."
            ];
    BOOK521 = ["Weapon does not take effect and only buy.Let's always equipped!",
            "The weapon will be divided into roughly, physical attack system and the magic attack system.<BR>In the case of magic, please keep in mind that it does not trigger the MP is not enough.",
            "At first hit rate is an important factor. <BR>Weapon good to carefully choose while watching a Weapon book. <BR>First is recommended is 'Dagger'.Since the weapons to continue to use, the Level of skill is increased, please try to find a favorite weapon! ",
            ];
    BOOK531 = ["Now it is finally adventure. Let's go to the'Fantasia prairie' from the outskirts. ",
            "Move to the right when you touch the right half of the screen, you can move to the left when you touch the left half.",
            "You come out enemy after a while advancing to the right to a just by automatically attack into the attack range. <BR>Let's attack facing the enemy.",
            "Also, back to zero step to return to the town when you move to the left.",
            "The go much to the right, when it exceeds the number of steps of the stage to enter the camp becomes the stage clear. <BR>You can also choose to return to the town,or you can also further advance in the back.",
            "If you basically to clear the 4 stage, and you will have cleared the adventure destination. <BR>However 4 stage last to run away or destroy so waiting BOSS, please overcame Good luck. ",
            "Although later cleared to return to the town, a new stage has been added to the outskirts. <BR>Since comes out strong enemy than, please come out to adventure further preparing."
            ];  
    BOOK541 = ["The timing of the save is as follows.<BR>·When you open the status.<BR>·When you return from the equip.<BR>"+
            "·When you return to town from castle,weapon,smith.<BR>·When the game over.",
            "Save slot has two and there separate data."
            ];  
    BOOK551 = ["Kingdom calendar is 1 year 300 days. <BR>100 days, 200 days, to 300 days will be held the festival.",
             "Birthday becomes the first day of the year, it will raise the age and greet the birthday.<BR>When more than 40-year-old's body as accident comes out in. Automatic lost by age rises it is not. "
            ];  
    BOOK561 = ["By the weapon,attack range is different. <BR>Attack range has the advantage such as pre-emptive attack.<BR>However, there is 'hit rate' correction by the distance to the enemy.",
            "Distance: 0 = hit rate: 10 times <BR>Distance: 1-10 = hit rate: 3 times <BR>Distance: 11-50 = hit rate: 1 times <BR>Distance: 51- = hit rate decreases as the distance increases"
            ];            
    BOOK571 = ["Job point is added to each time you defeat the enemy. <BR>☆1 0~99 <br>☆2 100~299 <br>☆3 300~999 <br>☆4 1000~1999 <br>☆5 2000~4999",
            "☆6 5000~9999 <br>☆7 10000~19999 you can take over the level up job<br>☆8 20000~39999 <br>☆9 40000~74999 <br>☆10 75000~99999 <br>☆MASTER 100000 ~ ",
            "When equipped with a specific weapon type to the job each bonus will occur. When the job point increases, the effect of the bonus will increase.",
            "Job MASTER always effect <BR>Adventurer ... EXP UP<BR>Villager ... Add nights to inn<BR>Warrior ... attack power UP<BR>Sorcerer ... magic power UP",
            "Priest ... regenerate UP<BR>Hunter ... hit rate UP<BR>Thief ... treasure chest incidence UP<BR>Samurai ... critical damage UP<BR>Load ... regenerate spd UP",
            "Bishop ... state tolerance UP<BR>Ninja ... citicak rate UP<BR>Barnstormer ... evasion rate UP,Enemy appearance UP<BR>Armor ... defensive UP<BR>Lode expert ... Crystal discovery rate UP & take over",
            "Majin ... magic defense UP<BR>Knights of Round ... absolute field UP<BR>Aura battler ... absolute attack UP<BR>Powered Suit knight ··· MAX HPUP", 
            "Brave ... damage up to Boss<BR>Doll Master ... gold take over<BR>Slimer ... move speed limit up",            
            ];
    BOOK581 = ["Enough to continue to use the same weapons, will raise the skill level of the weapon. Proficiency rises and weapons of each type of bonus has occurred, such as a physical attack power and magic attack power continue to slightly up mass is. and also it would be fun to continue to use the favorite weapon! ",
            WEAPON_TYPE_L[0] +" → "+ WEAPON_TYPE_P_L[0] + "<BR>" + WEAPON_TYPE_L[1] +" → "+ WEAPON_TYPE_P_L[1] + "<BR>" + WEAPON_TYPE_L[2] +" → "+ WEAPON_TYPE_P_L[2] + "<BR>" + WEAPON_TYPE_L[3] +" → "+ WEAPON_TYPE_P_L[3] + "<BR>" + WEAPON_TYPE_L[4] +" → "+ WEAPON_TYPE_P_L[4] + "<BR>" + WEAPON_TYPE_L[5] +" → "+ WEAPON_TYPE_P_L[5],
            WEAPON_TYPE_L[6] +" → "+ WEAPON_TYPE_P_L[6] + "<BR>" + WEAPON_TYPE_L[7] +" → "+ WEAPON_TYPE_P_L[7] + "<BR>" + WEAPON_TYPE_L[8] +" → "+ WEAPON_TYPE_P_L[8] + "<BR>" + WEAPON_TYPE_L[9] +" → "+ WEAPON_TYPE_P_L[9] + "<BR>" + WEAPON_TYPE_L[10] +" → "+ WEAPON_TYPE_P_L[10] + "<BR>" + WEAPON_TYPE_L[11] +" → "+ WEAPON_TYPE_P_L[11] ,
            WEAPON_TYPE_L[12] +" → "+ WEAPON_TYPE_P_L[12] + "<BR>" + WEAPON_TYPE_L[13] +" → "+ WEAPON_TYPE_P_L[13] + "<BR>" + WEAPON_TYPE_L[14] +" → "+ WEAPON_TYPE_P_L[14] + "<BR>" + WEAPON_TYPE_L[15] +" → "+ WEAPON_TYPE_P_L[15] +"<BR>" + WEAPON_TYPE_L[16] +" → "+ WEAPON_TYPE_P_L[16] + "<BR>" + WEAPON_TYPE_L[17] +" → "+ WEAPON_TYPE_P_L[17] ,
            WEAPON_TYPE_L[18] +" → "+ WEAPON_TYPE_P_L[18] + "<BR>" + WEAPON_TYPE_L[19] +" → "+ WEAPON_TYPE_P_L[19] + "<BR>" + WEAPON_TYPE_L[20] +" → "+ WEAPON_TYPE_P_L[20],    
            ];  
    BOOK591 = ["By sending the data to the 'world of the cloud', you can transfer the saved data to another terminal. <BR> ※ Cloud server service may stop and end without notice because your note on your use Please.",
            "1. Send the data from 'Send the data to the World of cloud' to the server by setting a name and password. <BR>Then, you'll make sure the ID that is displayed next to the name of the brave. ",
            "2. From another save data,enter to the 'Reborn in a cloud of data', Setting the ID, name, password and 'Chcek the data' →'Move to data confirmation screen' ",
            "3. If the data confirms the press the 'Reborn', overwriting the player data to confirm the data. <BR>Since overwritten data can not be recovered, please use on the check! "
            ];     
    BOOK5A1 = ["Various effects are exerted when equipped with accessories that enemies drop.<BR>If you get the same accessory and replaced automatically what effect is high.<BR>On EUIIP Upper right,It will move to the accessory equipment."]; 
    
    BOOK5B1 = [ "You can go on an adventure together with fellow.<BR>Let's look as much as possible strong fellow!",
                "How to make a fellow<BR>If you victory on cloud or Tower of Babel, you can make a fellow.",
                "Fellow status <BR>Status → Touch the fellow name → Fellow status <BR>Here in the companion of the status of the fellow, you can check the correction value at the time of the battle.",
                "Parting with fellow <BR>·When player selects another fellow.<BR>·In fellow status screen.<BR>·When player defeated."]
                ;
    DEADSTAGE = "What? Nostalgic smells in the vicinity.";
    DEADSTAGE1= "You picked up the equipment of adventure who fell before!";    

    AMULET = "Amulet";
    SMITH_1 = "Train the amulet";
    SMITH_2 = "Make a Rune";
    SMITH_3 = "Engrave a Rune";
    
    SMITH_10 = "Do you want to increase the number of characters Rune?";    
    SMITH_11 = "The maximum number of Rune";
    SMITH_12 = " characters";
    SMITH_13 = "Train the amulet : ";
    SMITH_131 = "■One character";
    SMITH_132 = "■Multiple character";
    SMITH_133 = "■STOP";    
    SMITH_14 = "How Wait a minute ················ now.Do you want to increase in a row?";    
    SMITH_15 = "That gold is not enough. Come earns more.";
    SMITH_16 = "Now,i can't no more increase the number of characters Rune.";    
    
    SMITH_20 = "Do you want to increase what Rune?";
    SMITH_24 = "How Wait a minute ················ now.Do you want to increase in a row?";    
    SMITH_21 = "Type of Rune";
    SMITH_22 = "Max";
    SMITH_23 = "Crystal";
    SMITH_25 = "That crystal is not enough. Come earns more.";
    SMITH_26 = "It can not any more!";

    SMITH_30 = "Do you want to engrave what Rune?";
    SMITH_34 = "How Wait a minute ················ now.Do you want to engrave in a row?";
    SMITH_31 = "Type of Rune";
    SMITH_32 = "Set";
    SMITH_33 = "Max";    
    SMITH_35 = "No more does engrave.";
    
    RUNE01 = "Force";//攻撃力
    RUNE02 = "Iron-clad";//防御力
    RUNE03 = "Hawk eye";//命中率
    RUNE04 = "Illusion";//回避率
    RUNE05 = "Fists";//攻撃速度
    RUNE06 = "Greed";//強欲
    //RUNE07 = "Blow";//必殺倍率
    RUNE07 = "Sloth";//怠惰
    RUNE08 = "Swift";//移動速度
    RUNE09 = "Wise";//魔法攻撃
    RUNE10 = "Barrier";//魔法防御
    //RUNE11 = "Cliff";//絶対防御
    RUNE11 = "Challenge";//挑戦
    RUNE12 = "Treatment";//状態耐性
    //RUNE13 = "Healing";//回復
    RUNE13 = "Gold";
    RUNE14 = "Bless";//回復速度
    RUNE15 = "Not fall";//HP
    RUNE16 = "Spirit";//MP
    RUNE17 = "Intense";//吹き飛ばし
    RUNE18 = "Horn";//敵寄せ    
    RUNE19 = "Get";//ゲット   
    RUNE20 = "Check";//観察   
    RUNE21 = "Criff";//絶壁   
    
    //RUNES = ["Force","Iron-clad","Hawk eye","Wise","Barrier","Not fall","Illusion","Spirit","Intense", "Greed","Bless","Blow","Swift","Cliff","Healing","Fists","Horn","Get"];
    RUNES = ["Force","Iron-clad","Hawk eye","Wise","Barrier","Not fall","Illusion","Spirit","Intense", "Greed","Bless","Sloth","Swift","Challenge","Gold","Fists","Horn","Get","Check","Criff"];
    RUNE_NAME = [
        "If you carve a Force, it will increase 'attack'.When the original value is large, the value that increases up.",
        "If you carve a Iron-clad, it will increase 'defense'.When the original value is large, the value that increases up.",
        "If you carve a Hawk eye, it will increase 'hit rate'.When the original value is large, the value that increases up.",
        "If you carve a Wise, it will increase 'magic power'.When the original value is large, the value that increases up.",
        "If you carve a Barrier, it will increase 'magic defense'.When the original value is large, the value that increases up.",
        "If you carve a Not fall, it will increase 'max HP'.When the original value is large, the value that increases up.",
        "If you carve a Illusion, it will increase 'evasion rate'.When the original value is large, the value that increases up.",
        "If you carve a Spirit, it will increase 'max MP'.When the original value is large, the value that increases up.",
        "If you carve a Intense, it will increase 'push power'.When the original value is large, the value that increases up.",
        "If you carve a Greed, low level of treasure box will not appear.It will be effective in every engrave 50.",
        "If you carve a Bless, it will increase 'regenerate speed'.",
        //"If you carve a Blow, it will increase 'critical damage'.When the original value is large, the value that increases up.",
        "If you carve a Sloth, to perform automatic combat in 'AUTO'.If you do not to engraved 200 runes, it does not take effect.<BR>When limit exceeded ★ is displayed.",        
        "If you carve a Swift, it will increase 'move speed'.<BR>When limit exceeded ★ is displayed.",
        //"If you carve a Cliff, it will increase 'absolute field'.When the original value is large, the value that increases up.",
        "If you carve a Challenge, the amount of EXP is increased to acquire.If you do not to some extent engraved runes, it does not take effect.",
        //"If you carve a Healing, it will increase 'regenerate'.When the original value is large, the value that increases up.",
        "If you carve a Gold, the amount of gold is increased to acquire.",
        "If you carve a Fists, it will increase 'attack speed'.<BR>When limit exceeded ★ is displayed.",
        "If you carve a Horn, it will increase 'monster frequency'.If you do not to some extent engraved runes, it does not take effect.<BR>When limit exceeded ★ is displayed.",     
        "If you carve a Get, you will get more distant treasure boxes and money.",       
        "If you carve a Check, you will get information about enemy.",        
        "If you carve a Criff, it will increase 'absolute field'.When the original value is large, the value that increases up.",        
    ];
    
    CRY1 = "You found the Crystal lode ";

    NOTE1 = "The area before the brave has fallen:";
    NOTE2 = "The step before the brave has fallen:";
    NOTE3 = "The weapon before the brave had:";
    NOTE4 = "Items:";
    NOTE5 = "Defeated";
    NOTE6 = "Max damage:";
    NOTE7 = "Max level";
    NOTE8 = "Total pow:";
    NOTE9 = "Rank:";
    NOTE10 = "Days:";    
    NOTE11="Fellow:";
    
    STAGE32_1="The moment you enter the mysterious gate,<br>it seems you were skipped in somewhere.";
    STAGE36_1="The moment you enter the mysterious gate,<br>it seems you were skipped in somewhere.";
    STAGE40_1="The moment you enter the mysterious gate,<br>it seems you were skipped in somewhere.";
    STAGE63_1="I feel the evil sign...";    
    

    STAGE99_1 = "Bad feeling...<br>You have shuddered to see the strangely smooth rock.";
    STAGE98_1 = "Bad feeling...<br>You've been full of tears from the eye for drifting pungent odor.";         
    STAGE97_1 = "Bad feeling...<br>Blue light is making eerie shadows.";         
    STAGE96_1 = "From somewhere mysterious voice is heard!<BR>When you take away the seven of the balls from me, I will show you my true strength!";
    STAGE95_1 = "From somewhere mysterious voice is heard!<BR>'My children,let's fight!!'";   
    STAGE95_2 = "'....We shall return!!'"; 
    STAGE94_1 ="'Thanks for your favor!! We will fight to fully!!'";
    
    STAGE115_1 = "BOoooooom···<br>Eerie sound rang!!!<BR>Monsters come around!"; 
    STAGE151_1="Boom!<BR>Naval gunfire!";    
    STAGE152_1 = "Well come to the Beginner house!! <BR> ···Are you really beginner?? If you defeat me, I'll give you a gift.";
    STAGE153_1 = "Here, the slime that cause the abnormal state to emerge!!<BR>By increasing the faith, state abnormally can compete.";
    STAGE154_1 = "I tried to mix a more horrible slime.<BR>Can it really be overcome this ordeal?";
    STAGE155_1 = "It is the last stage!<BR>If I'll be releasing a new rune After defeat me.";    
    
    STAGE_OUT = "<BR>Enemy Appearance:";

    RARE="Rare";
    PRICE="Price";    
    NEED_MP ="MP cost";
    ATTACK_RANGE ="Range";
    WEIGHT="Weight";
    MAX_SPEED ="Max speed"; 
    
    PUB0 = "■Message board";
    PUB01 = ["Feb 12 2016<BR>You are now to be able to be a fellow who you were defeated in the world of cloud!",
            "Dec 26 2015<BR>Odin has appeared!!You'll try him,If you are max level.",
            "Nov 24 2015<BR>That should have been sealed in the ancient white dragon has been witnessed! No way ... black dragon too?",
            "Nov 19 2015<BR>Back of the cliff seems to be what made 'Beginner's house'!<BR> I was to go immediately!! <BR>··· For beginners??",
            "Nov 01 2015<BR>Finally,on the other side of the world was also led by the cloud!In parallel world, I guess there are any people? It is fun.",
            "Oct 06, 2015<BR>Hmm? It will have something moo-cow and cries from the back of the cliff...",
        　　"Sep 20, 2015<BR>What!!It seems the new old dragon is found!!!<BR>Oh,new and old...confusing.",
            "Aug 15, 2015<BR>Congratulations!!<BR>It appeared brave that was finally Disrupt Babel tower!",
             "Aug 1, 2015<BR>What!!It seems the new old dragon is found!!!",
            "July 22, 2015<BR>It's news! King was suddenly issued a kingdom year!<BR>Adventurers seems to become suddenly to 16 years old. <BR>Everyone, very young!",
            "July 8, 2015<BR>What!!It seems the new old dragon is found.<BR>The pungent smell is...?",
            "June 22 2015<BR>The building that the king had been building found a 'Tower of Babel'. <BR>It is apparently as fighting field!<BR>Did fun yet?",
            "June 9 2015<BR>Finally reported to have subdue the Awakened Ancient Dragon of legend has entered.<BR>Congratulations!!",
            "June 3 2015<BR>It seems to challenge all over the world, but do not seem yet nobody beat the Ancient Dragon!<BR>",
            "May 30 2015<BR>Also it seems the king has built a strange something.What on earth?",
            "May 23 2015<BR>Very! By stimulated, dragon of legend wake up in earnest. Please do not approach the absolute!",
            "May 20 2015<BR>Finally reported to have subdue the Ancient Dragon of legend has entered.<br>Congratulations!!"];


    PUB1 = "■Man who have the apple";
    PUB11 = ["I'm YamaohGames ,thank you for playing!! In  Japan , I'm working hard for the world expansion :-)",
            "Journey of a thousand miles from one step!"];
    
    PUB2 = "■Man drinking a glass of milk";
    PUB21 = [//"You looks like new face .Well... first you  would be aim of level 40.",
             //"First recommended warrior for beginners. <BR> You'll defeat slime with a single blow.",
             "You look new here, your first goal should be to aim for level 40.",
             "You should start with warrior, you will defeat slimes in a single blow.",             
             "In order to increase the hit rate, good to keep it is also the hunter. <BR>You'll be  raised the level for a while.",
             "If you are done immediately,you'll be priest for recovery amount of HP is increased more and more.",
             "Thief get a lot of treasure chests.<BR>Treasure,you come to get equip in adventure, or  change to the money by selling it good.",
             "You'll increase job number  a lot more,if your level increases to some extent.",
             "When the last to add, it's out on an adventure after obtaining the knowledge in the Central Library.<BR>Good luck!!"];             
    
    PUB3 = "■Man who wear a frog shirt";
    PUB31 = ["You know what?I hear that the king had made Super Upper Job.It seems necessary to level 300.Who would do to reach it?",
             "Well nothing to do with me, but I hear are veteran beyond the level 1000 according to the rumors. <BR>When it exceeds 1000, it seems to be occasionally requires a large amount of experience.",
             "The upper there is trouble above.",
             "That reminds me,the highest ranking weapon, it seems the enemy to drop the weapon of the rank 11 have."
            ];
    
    PUB4 = "■Man who gnaw a huge hamburger";
    PUB41 = ["Ah!! ··· But suddenly!! <BR>The king began to level up of Job, seems to differ by each occupation!",
            "Is it level up possible job ★ is attached in the castle. <BR>You have to pay the reserve by tapping the job. <BR>Well, this is I'm seems absurdly high." ,
            "This is the condition of the level up heard in the rumor. <br>Adventurer ... kill a lot of enemy <br>Villagers ...to work hard, even if defeated <br>Warrior ... old dragon defeat and equip <br>Sorcerer ... magic up ",
            "Priest···faith up<br>Hunter...dexterity up<br>Thief...luck is all <br>Samurai...quickly and accurately <br>Load...beats the thousands of enemy ",
            "Bishop···Carve a wise<br>Ninja...blow killer damage!!<br>Barnstormer...increase the number of rune<br>Armor...hard and hard <br>Lode expert...collect crystal "];
    PUB42 = ["You exceeded the level 2000!<BR>These are likely further conditions.",
            "Famous adventurer···Get a butterfly<br>Mayer···Reincarnation<br>Doragon Warrior···Proof of black dragon subdue<BR>Wizard···Get 3 Dark weapons.<BR>High priest···The training of 100 days in the Labyrinth.",
            "Ranger···Get the goddess power of the moon<BR>Thieves head···Show me the Emerald Star<BR>Samurai Daishou···Muramasa<BR>Master Load···A million<BR>Sage···Carve a wise<br>Shadow···Exceed 4×8",             
            "Jester···Carve a Horn and clap a drum<BR>Hyper Armor···Carve a Iron-clad<BR>Earth expert···Heaven wing(rare)<br>Majin···It captures the part of the Devil in the body,and survive",
            "Knights of Round···The Babel Tower intently to climb<BR>Aura battler···Carve a Rune of Fists<br>Powered Suit knight···need ancient magic 'Solar Ray'",
            ];                
             
    PUB5 = "■Man who speely and traveler style";
    PUB51 = ["Hmm, seems to come out quite strong monster in this island. <br> It would be severely If you do not know the enemy in the coming battle.",
            "First enemy  keep  a status in the same way as you,attack and defense,evasion and hit rate.",
            "Even if your hit rate more than 100 percent,enemy has a more evasion, you'll miss.",
            "The stronger even it speaking the reverse, however, that it someday you can be overwhelmed.",
            "Well, the thing work hard and believe in your potential."
            ]; 
    PUB6 = "■Face is bright red man";
    PUB61 = ["When the story that I heard in my old man, this Fantasia's so has led to all kinds of places.",
             "That Maybe the fact that most strong in this island, it comes to the strongest in the world.",
             "In the past human being's story standing by causative old dragon.<BR>I used to wonder human tribe was strong most.",
             "There was a great war between humans in ancient times around here.<BR>Apparently only one of the stranger had gone to end the war in the legend.<BR>I wonder what it was guy?"
             ]; 

    PUB7 = "■Gatekeeper of Valhalla";
    PUB71 = ["Break after the work is finished is the best!<BR>What? What you want to know about the Valhalla?",
             "Valhalla is heavenly paradise that was overthrown in the fight who we visit after death.<BR>Odin of residence also.",
             "The more the number of souls visit to Valhalla, the feelings are attracted to the human world, it made many may appear to Fantasia sky.",
             "But when human visits once Valhalla, because souls can become happy, Valhalla also stay away from the human world.",
             "Also it Odin pet we're crawling in Valhalla, but it is in human beings will look to treasure of the mountain!",
             "If the you are love unlimited, Watch out because Valkyrie who comes flying in!!",
             "If properly pay the entrance fee, I'll safely escorted to Valhalla.",
             "Odin has appeared!!<BR>If you are max level,you'll be able to challange odin!"
             
             ];   
    PUB72 = ["Oops!!It's about time of job!"];            
    
    PUB8 = "■Festival man";
    PUB81 = ["Hummm...,more than 40 years old,physically declined... I want to open the my 'Dojo' early.",
            "If it exceeds the level 1000,it seems able to challange 'Dojo Master'! <BR>Good luck!!",
            "Oh, recently I hear haunt rare monster in festival day.<BR>Watch out enough care!"
             ]; 
             
    PUB9 = "■Silver-haired a bitter man";
    PUB91 = ["You have pretty good eyes. You are always chasing something, it's such an eyes.<br>Are you interested in the story of around the legend?",
             "Winter, deep in the top of the mountain was penetrate the cloud, only those who were extremely adventurers to the eye, that there are such a butterfly.But seems to attract also at the same time brutal devil. Have the courage to pursue it to the differents? ",
             "Far ancient times, one of our ancestors sealed the ancient mother dragon, there is a legend that was weakened the other dragon. <BR>Also order to hide the fater doragon, the ancient dragon hidden the body as each of six treasured.",
             "... Well is not necessarily say anything differents it will go. Be careful."
            ];
            
    PUB10 = "■Man who wears glasses";
    PUB101 = ["Dou you have new story? <BR>Always new things, it is my policy.",
              "White dragon call her children, and they have take over ability.Outrageous it!",
              "According to the rumors in Farthest land, it seems different from the number of stars visible by the people. Now I wonder if there are people who can see all the stars."
             ];
            
    TOWER1 = "Here's Arenes of the Tower of Babel Fantasia. <BR>You aim for the top floor if there is confidence. <BR>But still in test operation.";
    TOWER11 = "Current Rank:";
    TOWER20 = "Entry the battle.";
    TOWER30="Rules";
    TOWER31 = ["This tower of Babel's arena that adventurers who were gathered from in Fantasia compete against the arm.",
             "If you win,your rank will increase. If you lost, rank falls.",
             "If you win,you can carry over crystal to next battle,and you can get more crystals if you win in continuous.",
             "Ready in after entry anteroom to the arena.Here from beyond the point of no return is.<BR>Well, such was relieved because really will not die, even if defeated.You only lose gold half!!",
             "Sometimes it is possible to pick up the equipment of the enemy.<BR>But there is just as well that you lose the equipment.<br>Although the probability is low.",
             "Now, with the aim of higher hierarchy have been working hard!!"
            ];    

    TOWER_B1 = "Tower of Babel";
    TOWER_B2 = "Give up";
    TOWER_B3 = "Start!!";
    TOWER_B4 = "You win!!";
    TOWER_B5 = "End";
    TOWER_B6 = "You've lost the battle.";
    TOWER_B7 = "Rank ";
    TOWER_B8 = " went up to!";
    TOWER_B9 = " dropped to!";
    TOWER_B10 = "room";
    TOWER_B11 = "Information of next opponents.";
    TOWER_B12 = "Start the battle";
    TOWER_B13 = "Astain";
    TOWER_B14 = "You lost the equip!!";
    TOWER_B15 = "Continue";
    TOWER_B16 = "Win:";
    TOWER_B17 = "Reward Crystal:";     
    TOWER_B99="You have arrived reached the top of the tower!! Congratulations!!<BR>Thank you for playing!!"; 

    TOWER_ENEMY1 = [""];
    TOWER_ENEMY2 = [""];
    TOWER_ENEMY3 = [""];
    TOWER_ENEMY4 = [""];

    YES = "■YES";
    NO = "■NO";    
    
    STATE = "STATE：";
    STATE_STN = "STN ";
    STATE_PAR = "PAR ";
    STATE_SLP = "SLP ";
    STATE_DED = "DED ";
    STATE_POI = "POI ";     
    
    ATR = "attribute";
    ATR1 = ["normal","physical invalid", "physical reflection", "magic invalid", "magic reflection", "long-range invalid","critical invalid","Special","Mirror","run away","damage half cut"];

    PHY = "attack";
    MGC = "magic";
    HITP = "hit rate";
    
    STAGE_NO_ENEMY = "There is no other enemy of the signs in around here...";
    WAL10 = "Here is the entrance of Valhalla that brave and monsters of the soul are sleeping that was defeated in battle.<BR>Do you rise to Valhalla?";
    WAL11 = "Entrance fee";
    WAL12 = "Oh, you don't have entrance fee!<BR>Odin bless it!";    
    WAL21 = "Apparently Odin seems to be the absence!!<BR>Right now!!";    
    WAL22 = "When you defeat me, I'll give you new Max power.";    

    DOJO01 = "Here is 'Dojo'<BR>If you win to me, I'll hand over this 'Dojo'!!";
    DOJO02 = "You are  'Dojo Master'.<BR>You can take over to new Adventurer!!";    
    DOJO03 = "Hmm, you became stronger when I met for the first time in a long time.<BR>Well, come challenged with full force!!";   
    DOJO04 = "Hmm, it seems there is no eligible to still challenge me!<BR>It is better to have come from the more training!";          
    
    DOJO10 = "Rules of TAKE OVER";
    DOJO11 = ["When you win to Master, you can become a Master.<BR>In 'Dojo',You can take over the ability to the next adventurer.<BR>The more you taked over,the ability value will continue to up.",
             "Take over the contents are as follows.<BR>·take over number<BR>·ability × level coefficient + take over bonus<BR>·[E]euip,weapon shop list<BR>·amulet and runet<BR>·job level(job point >= 10000)<BR>·book and record",
             "Not take over the contents are as follows.<BR>·level,experience<BR>·age<BR>·gold,crystal,not [E]equip list<BR>·job level(job point < 10000)<BR>",
             "Take over itself can do many generations, but once take over,before adventurer that would retire.<BR>Earnestly available is intentionally!!",
             "Also, if you have taken over, the following master will be previous adventurer.<BR>Do not defeat this master, does not take over. <BR>Please Good luck."
             ];        
    DOJO12 = "Challenge battle to 'Dojo Master'!!";             
    DOJO13 = "You got a successful challenge!!<BR>You are new 'Dojo Master'!!";          
    DOJO14 = "You failed!! <BR>You've been thrown out in town!";             
    DOJO15 = "Check Dojo Master status";        
    DOJO16 = "This is Dojo Master status.";            
             
    DOJO20 = "Take over(Move to take over screen)";
    DOJO21 = "It take over the status of the above<BR>  (Bonus is not carried over)"; 
    DOJO22 = "pre bonus";    
    DOJO30 = "Take over is finished, a new adventurer was born!!<BR>You until now, it was really cheers for good work!!";     
    DOJO31 = "No longer would not a person who can take over your ability ... the future will train yourself.";    
    
    MINO01 = "Moo!Moo!Moo! (Came well to Labyrinth) <BR>Moo!Moo!Moo! (Entering the Labyrinth?)";
    MINO10 = "Labyrinth";
    MINO11 = "Enter the Labyrinth";
    MINO12 = "Entrance fee";
    MINO13 = "DAYS";
    MINO14 = "Maximum days:";
    MINO15 = "Momomo! (You do not have enough money)";
    MINO30 = "Rules";
    MINO31 = ["This labyrinth in it is possible to fight the monsters defeated in the past.<BR>However mode you need to pay attention to too much use because the faster the flow of time in this labyrinth.",
              "This is the labyrinth of rules.<BR>·Enemy unlimited emerging<BR>·Treasure chest, gold does not appear.<BR>·Enemy is strengthening at a certain time.<BR>·Knocked down immediately save.<BR>·More steps increase,time flow faster",
              "Since the day the enemy is stronger and goes, it is good to try to challenge or put many days."];
    MINO21 = "You was survived from the labyrinth of the Minotaur!";
    MINO22 = "Days = ";
    MINO23 = "Number of steps = ";     
    MINO24 = "Number defeated = "; 
    MINO25 = "Reward Gold";    
    MINO26 = " count";
    MINO27 = "Reward Crystal";
    MINO28 = "Reward magnification ";    
    MINO41 = ["'Hahaha. Well came up here! I'll lightly opponent!'",
        "'Hahaha. Careless with the little while ago.I'll out the serious!'",
        "'Hahaha. Actually it's bad the condition of the stomach is a little while ago. Now do I'm gonna.'",
        "'Hahaha. You are pretty good. But it is also gonna show the story. Cattle-Fists up here.'",
        "'Hahaha. Na Since the earlier of Cattle-Fists was a long time. Eat this!! This is True-Cattle-Fists!!'",
        "'Hahaha. Gu-gu-gu ... no longer holding back'm .3 Double-True-Cattle-Fists that do!!'",
        "'Hahaha....I do laugh anymore. While it is good see the power of true cow!'",
        "'Finally defeat the differents as either. Cattle devil was in serious me !!'",
        "'... I will Enjoy the words even without!! Desperate struggle to talk anymore!'",
        "'Finally ... Now's the end. Fathers of Cattle king! Me to bestow the power !!'"
    ];
    MINO42 = [
        "'Wow!'",
        "'Strategic change course!!'"
    ];
    
    CLD10 = "You can connect the another world through the cloud!! <BR>But still prototype stage! <BR>※ This function need the state must be able to communicate state. ";
    CLD11 = "Send the data to the World of cloud";
    CLD12 = "World Ranking(TOP100)";
    CLD13 = "▼Name of brave";
    CLD14 = "Please enter a name!!";
    CLD15 = "Please enter at 8 characters or less!";
　　CLD151 = "Password, please set in <BR> 6 characters more than 10 characters or less!";    
    CLD16 = "※It is used for Ranking and Backup(plan).";
    CLD17 = "End the connection!!";
    CLD18 = "Enter name is already be used.Please enter anoter name!!";
    CLD19 = "Communication error has occurred!";
    CLD20 = "in connecting ...";
    CLD21 = "Data have been deleted!";
    CLD22 = "Failed!";
    CLD23 = "Rank";
    CLD24 = "Total";
    CLD25 = "Name";
    CLD251 = "(touch to detail)";    
    CLD26 = "Level";
    CLD27 = "Take over";
    CLD28 = "Tower rank";
    CLD29 = "Labyrinth days";
    CLD30 = "ID =";
    CLD31 = "Delete the server data";
    CLD32 = "Send the data";   
    CLD33 = "Your Ranking：";  
    CLD34 = "Update";
    CLD35 = "days ago";

    CLD40 = "Reborn in a cloud of data";
    CLD41 = "▼ID on Colud";
    CLD42 = "▼Name on Cloud";
    CLD43 = "▼Password(for backup)";
    CLD44 = "※If input ID, name, password match, <BR>display the confirmation screen to get the data.";
    CLD45 = "Check the data";
    CLD46 = "Please enter all the items!";
    CLD47 = "Data not found!";
    CLD48 = "Data found!";
    CLD49 = "Move to data confirmation screen";
    CLD50 = "Reborn <BR> (it will be overwritten to the current player data)";
    CLD51 = "You are reborn new!!";    
    
    CLD52 = "Brave data on cloud";
    CLD53 = "Apply for a duel to the Brave of the cloud<BR>(Test ver)";
    CLD53_1="Cloud Battle field";
    CLD53_2="Give up";
    CLD53_3="Start!!";
    CLD53_4="You win!!";
    CLD53_5="End";
    CLD53_6="You've lost the battle.";
    
    RACE = "Race";
    RACE_A = ["Slime", "Monster", "Human(physical)", "Immortal", "Substance", "Sprite", "Dragon", "Beast", "Spirit", "Beast man", "Hi-beast",
            " Angel"," Giant"," Devil","Human(magic)","Semi-God","Magical things","Rare","Goddess","God"," Majin","Small","Machine","Ancient dragon"];    
    //ENEMY_ATTACK = "'s Fatal blow !!";
    ENEMY_ATTACK1 = "'s ";
    ENEMY_ATTACK3 = "critical ";        
    ENEMY_ATTACK2 = " damage!!";
    ENEMY_ATTACK4 = "deadly poison ";    
    ENEMY_ATTACK5 = "poison ";         
    
    TYPE_L = "TYPE";
    TYPE_1 = "Physical";
    TYPE_2 = "Magic";
    
    ACCESSSORY_ITEM = ["defense","magic defense","damage cut","critical rate neutralization","move speed","rare item appearance","regenerate","regenerate speed"];        

    PARTY1 = " seems to want to be a your fellow.";
    PARTY11 = "■To fellow (you broke up with current fellow)";
    PARTY12 = "■Not to fellow";
    PARTY13 = "■Break up with fellow";
    PARTY14 = "Fellow status";
 
    setJobLanguage();
    setWeaponLanguage();
    setEnemyLanguage();   
    setAccessoryLanguage();
    
}

